[
    {
        "countryName": "Italy",
        "category": "veg",
        "id": 1,
        "meal_name": "Margherita Pizza",
        "cooking_items": "dough, tomato sauce, mozzarella cheese, basil leaves",
        "duration": "30 minutes",
        "rating": 4.8,
        "how_to_cook": "1. Preheat the oven to 475°F (245°C).\n2. Roll out the dough and spread tomato sauce evenly.\n3. Sprinkle shredded mozzarella cheese and basil leaves.\n4. Bake for 10-15 minutes until crust is golden brown.",
        "favorite": true,
        "imageName": "margherita_pizza",
        "description": "A classic Italian pizza featuring a thin crust topped with tomato sauce, fresh mozzarella cheese, and fragrant basil leaves.",
        "protein": "12g",
        "carbohydrates": "35g",
        "fat": "10g",
        "fiber": "2g",
        "calcium": "200mg",
        "iron": "2.5mg"
    },
    {
        "countryName": "Italy",
        "category": "veg",
        "id": 2,
        "meal_name": "Eggplant Parmesan",
        "cooking_items": "Eggplant, marinara sauce, mozzarella cheese, Parmesan cheese, breadcrumbs, olive oil, fresh basil",
        "duration": "1 hour",
        "rating": 4.7,
        "how_to_cook": "1. Preheat oven to 375°F (190°C).\n2. Slice eggplant and coat slices in breadcrumbs.\n3. In a baking dish, layer marinara sauce, eggplant slices, mozzarella, and Parmesan cheeses.\n4. Repeat layers and bake for 30-35 minutes until bubbly and golden.\n5. Garnish with fresh basil before serving.",
        "favorite": false,
        "imageName": "eggplant_parmesan",
        "description": "A hearty Italian dish featuring layers of breaded eggplant slices, marinara sauce, melted mozzarella, and Parmesan cheeses, baked to perfection.",
        "protein": "15g",
        "carbohydrates": "25g",
        "fat": "18g",
        "fiber": "6g",
        "calcium": "300mg",
        "iron": "3.2mg"
    },
    {
        "countryName": "Italy",
        "category": "veg",
        "id": 3,
        "meal_name": "Caprese Salad",
        "cooking_items": "Fresh tomatoes, fresh mozzarella cheese, fresh basil leaves, extra virgin olive oil, balsamic glaze, salt, pepper",
        "duration": "15 minutes",
        "rating": 4.9,
        "how_to_cook": "1. Slice tomatoes and mozzarella into ¼ inch thick slices.\n2. Arrange alternating slices of tomatoes, mozzarella, and basil leaves on a serving platter.\n3. Drizzle with olive oil and balsamic glaze.\n4. Season with salt and pepper to taste.\n5. Serve immediately.",
        "favorite": true,
        "imageName": "caprese_salad",
        "description": "A refreshing Italian salad showcasing ripe tomatoes, creamy mozzarella cheese, and fresh basil leaves, drizzled with extra virgin olive oil and balsamic glaze.",
        "protein": "10g",
        "carbohydrates": "5g",
        "fat": "15g",
        "fiber": "2g",
        "calcium": "250mg",
        "iron": "1.8mg"
    },
    {
        "countryName": "Italy",
        "category": "non-veg",
        "id": 4,
        "meal_name": "Spaghetti Carbonara",
        "cooking_items": "Spaghetti, bacon, eggs, Parmesan cheese, black pepper, garlic, olive oil",
        "duration": "25 minutes",
        "rating": 4.8,
        "how_to_cook": "1. Cook spaghetti according to package instructions until al dente.\n2. In a skillet, cook bacon until crispy. Remove from pan and drain on paper towels.\n3. In a bowl, whisk together eggs, grated Parmesan cheese, minced garlic, and black pepper.\n4. Drain spaghetti and immediately toss with egg mixture in a large bowl.\n5. Crumble bacon over the top and serve hot.",
        "favorite": true,
        "imageName": "spaghetti_carbonara",
        "description": "A classic Italian pasta dish featuring spaghetti tossed with crispy bacon, a creamy Parmesan and egg sauce, and a hint of garlic and black pepper.",
        "protein": "20g",
        "carbohydrates": "50g",
        "fat": "25g",
        "fiber": "3g",
        "calcium": "150mg",
        "iron": "2.3mg"
    },
    {
        "countryName": "Italy",
        "category": "non-veg",
        "id": 5,
        "meal_name": "Osso Buco",
        "cooking_items": "Veal shanks, onion, carrots, celery, garlic, tomatoes, white wine, beef broth, flour, olive oil, salt, pepper, parsley",
        "duration": "2.5 hours",
        "rating": 4.6,
        "how_to_cook": "1. Season veal shanks with salt and pepper, then dredge in flour.\n2. In a large skillet, heat olive oil over medium-high heat and brown veal shanks on all sides.\n3. Transfer veal to a Dutch oven or slow cooker.\n4. In the same skillet, sauté onion, carrots, celery, and garlic until softened.\n5. Add tomatoes, white wine, and beef broth to the skillet. Pour mixture over veal in the Dutch oven.\n6. Cover and cook on low heat for 2-2.5 hours until veal is tender.\n7. Garnish with chopped parsley before serving.",
        "favorite": false,
        "imageName": "osso_buco",
        "description": "A luxurious Italian stew featuring tender veal shanks simmered with aromatic vegetables, tomatoes, and white wine until rich and flavorful, garnished with fresh parsley.",
        "protein": "12g",
        "carbohydrates": "35g",
        "fat": "10g",
        "fiber": "2g",
        "calcium": "200mg",
        "iron": "2.5mg"
    },
    {
        "countryName": "Italy",
        "category": "vegan",
        "id": 6,
        "meal_name": "Pasta Primavera",
        "cooking_items": "Pasta, assorted spring vegetables, olive oil, garlic, lemon juice, fresh herbs, salt, pepper",
        "duration": "20 minutes",
        "rating": 4.5,
        "how_to_cook": "1. Cook pasta according to package instructions until al dente.\n2. In a large skillet, heat olive oil over medium heat and sauté minced garlic until fragrant.\n3. Add assorted vegetables to the skillet and cook until tender-crisp.\n4. Toss cooked pasta with the vegetables in the skillet.\n5. Season with lemon juice, salt, pepper, and fresh herbs.\n6. Serve hot, garnished with additional fresh herbs if desired.",
        "favorite": false,
        "imageName": "pasta_primavera",
        "description": "A vibrant Italian pasta dish bursting with the flavors of spring vegetables, tossed with al dente pasta and a zesty garlic and lemon dressing, perfect for vegans and vegetable lovers alike.",
        "protein": "6g",
        "carbohydrates": "32g",
        "fat": "6g",
        "fiber": "6g",
        "calcium": "20mg",
        "iron": "1mg"
    },
    {
      "countryName": "India",
      "category": "vegan",
      "id": 7,
      "meal_name": "Chana Masala",
      "cooking_items": "Cooked chickpeas, vegetable oil, onion, garlic, ginger, tomatoes, ground cumin, ground coriander, turmeric powder, cayenne pepper, garam masala, salt, cilantro leaves",
      "duration": "40 minutes",
      "rating": 4.8,
      "how_to_cook": "1. Heat oil in a large skillet over medium heat.\n2. Add chopped onions and sauté until golden brown.\n3. Add minced garlic and ginger, and cook for another minute until fragrant.\n4. Stir in chopped tomatoes and cook until they soften and turn mushy.\n5. Add ground cumin, ground coriander, turmeric powder, cayenne pepper, and salt. Cook the spices with the tomatoes for a couple of minutes.\n6. Add cooked chickpeas to the skillet and mix well with the spices and tomatoes.\n7. Pour in about a cup of water, bring to a simmer, and let it cook for 10-15 minutes until the flavors meld together and the curry thickens.\n8. Sprinkle garam masala over the curry and stir to combine.\n9. Garnish with fresh cilantro leaves and serve hot with rice or naan.",
      "favorite": true,
      "imageName": "chana_masala",
      "description": "A classic Indian dish featuring chickpeas cooked in a flavorful blend of spices, onions, and tomatoes, garnished with fresh cilantro leaves, perfect for vegans and lovers of Indian cuisine.",
      "protein": "9g",
      "carbohydrates": "35g",
      "fat": "5g",
      "fiber": "10g",
      "calcium": "80mg",
      "iron": "3.5mg"
    },
    {
      "countryName": "India",
      "category": "vegan",
      "id": 8,
      "meal_name": "Baingan Bharta",
      "cooking_items": "Eggplants, vegetable oil, cumin seeds, onion, tomatoes, green chilies, ginger-garlic paste, ground coriander, turmeric powder, garam masala, salt, cilantro leaves",
      "duration": "45 minutes",
      "rating": 4.7,
      "how_to_cook": "1. Roast the eggplants over an open flame or grill until the skin is charred and the flesh is soft. Let them cool, then peel off the charred skin and mash the flesh. Set aside.\n2. Heat oil in a skillet over medium heat. Add cumin seeds and let them splutter.\n3. Add chopped onions and sauté until they turn translucent.\n4. Stir in chopped tomatoes, green chilies, and ginger-garlic paste. Cook until the tomatoes are soft and mashed.\n5. Add ground coriander, turmeric powder, garam masala, and salt. Mix well.\n6. Add the mashed eggplant to the skillet and combine with the spices and tomatoes. Cook for another 5-7 minutes, stirring occasionally.\n7. Garnish with fresh cilantro leaves and serve hot with roti or rice.",
      "favorite": false,
      "imageName": "baingan_bharta",
      "description": "A smoky and flavorful Indian curry made with roasted eggplants, onions, tomatoes, and aromatic spices, garnished with fresh cilantro leaves, perfect for vegans and lovers of Indian cuisine.",
      "protein": "4g",
      "carbohydrates": "20g",
      "fat": "8g",
      "fiber": "9g",
      "calcium": "40mg",
      "iron": "2mg"
    },
    {
      "countryName": "India",
      "category": "non-veg",
      "id": 9,
      "meal_name": "Chicken Tikka Masala",
      "cooking_items": "Boneless chicken, yogurt, lemon juice, garlic, ginger, ground cumin, ground coriander, garam masala, paprika, turmeric powder, tomato sauce, cream, butter, salt, cilantro leaves",
      "duration": "45 minutes",
      "rating": 4.9,
      "how_to_cook": "1. Marinate boneless chicken pieces in a mixture of yogurt, lemon juice, minced garlic, grated ginger, ground cumin, ground coriander, garam masala, paprika, turmeric powder, and salt. Let it marinate for at least 30 minutes.\n2. Preheat the oven to 400°F (200°C). Thread the marinated chicken pieces onto skewers and place them on a baking tray. Bake for 20-25 minutes until the chicken is cooked through.\n3. In a large skillet, heat butter over medium heat. Add minced garlic and cook until fragrant.\n4. Stir in tomato sauce and cream. Simmer for a few minutes until the sauce thickens.\n5. Add the baked chicken tikka pieces to the skillet and simmer for another 5-10 minutes, stirring occasionally.\n6. Garnish with fresh cilantro leaves and serve hot with rice or naan.",
      "favorite": true,
      "imageName": "chicken_tikka_masala",
      "description": "A popular Indian dish featuring tender pieces of chicken marinated in yogurt and spices, grilled to perfection, and simmered in a creamy tomato sauce, garnished with fresh cilantro leaves, perfect for non-vegetarians and lovers of Indian cuisine.",
      "protein": "30g",
      "carbohydrates": "15g",
      "fat": "18g",
      "fiber": "3g",
      "calcium": "100mg",
      "iron": "2.5mg"
    },
    {
      "countryName": "India",
      "category": "non-veg",
      "id": 10,
      "meal_name": "Tandoori Lamb Chops",
      "cooking_items": "Lamb chops, yogurt, lemon juice, garlic, ginger, ground cumin, ground coriander, garam masala, paprika, turmeric powder, cayenne pepper, salt, mint leaves",
      "duration": "35 minutes",
      "rating": 4.7,
      "how_to_cook": "1. In a large bowl, mix yogurt, lemon juice, minced garlic, grated ginger, ground cumin, ground coriander, garam masala, paprika, turmeric powder, cayenne pepper, and salt to make the marinade.\n2. Add lamb chops to the marinade and coat them well. Let them marinate for at least 1 hour, or preferably overnight in the refrigerator.\n3. Preheat the grill to medium-high heat. Remove the lamb chops from the marinade and shake off any excess.\n4. Grill the lamb chops for 3-4 minutes on each side, or until they are cooked to your desired doneness.\n5. Garnish with fresh mint leaves and serve hot with mint yogurt sauce and naan.",
      "favorite": false,
      "imageName": "tandoori_lamb_chops",
      "description": "Delicious and succulent lamb chops marinated in a blend of yogurt and aromatic spices, grilled to perfection, and served with a refreshing mint yogurt sauce, perfect for non-vegetarians and lovers of Indian cuisine.",
      "protein": "25g",
      "carbohydrates": "5g",
      "fat": "15g",
      "fiber": "1g",
      "calcium": "50mg",
      "iron": "3mg"
    },
    {
      "countryName": "India",
      "category": "veg",
      "id": 11,
      "meal_name": "Palak Paneer",
      "cooking_items": "Spinach, paneer (cottage cheese), vegetable oil, onion, garlic, ginger, tomatoes, green chilies, ground cumin, ground coriander, turmeric powder, garam masala, salt, cream",
      "duration": "45 minutes",
      "rating": 4.9,
      "how_to_cook": "1. Blanch spinach leaves in boiling water for 2 minutes. Drain and transfer to ice water to retain the color. Drain again and blend into a smooth puree.\n2. Heat oil in a pan. Add chopped onions, garlic, and ginger. Sauté until golden brown.\n3. Add chopped tomatoes and green chilies. Cook until tomatoes are soft.\n4. Add ground cumin, ground coriander, turmeric powder, and salt. Cook for 2-3 minutes.\n5. Pour in the spinach puree and cook for 5-7 minutes.\n6. Add cubed paneer (cottage cheese) and garam masala. Cook for another 5 minutes.\n7. Stir in cream and simmer for a few more minutes.\n8. Garnish with cream and serve hot with rice or naan.",
      "favorite": true,
      "imageName": "palak_paneer",
      "description": "A classic North Indian dish featuring creamy spinach curry with chunks of paneer (cottage cheese), delicately spiced and finished with a touch of cream, perfect for vegetarians and lovers of Indian cuisine.",
      "protein": "12g",
      "carbohydrates": "10g",
      "fat": "14g",
      "fiber": "4g",
      "calcium": "300mg",
      "iron": "2.5mg"
    },
    {
      "countryName": "India",
      "category": "veg",
      "id": 12,
      "meal_name": "Vegetable Biryani",
      "cooking_items": "Basmati rice, mixed vegetables (carrots, peas, cauliflower, potatoes), vegetable oil, onion, garlic, ginger, tomatoes, green chilies, bay leaves, cinnamon stick, cloves, cardamom pods, cumin seeds, ground coriander, ground cumin, turmeric powder, garam masala, salt, saffron strands (optional), milk (optional), fried onions, mint leaves, cilantro leaves",
      "duration": "60 minutes",
      "rating": 4.7,
      "how_to_cook": "1. Wash and soak basmati rice in water for 30 minutes. Drain and set aside.\n2. Heat oil in a large pan. Add whole spices (bay leaves, cinnamon stick, cloves, cardamom pods) and cumin seeds. Sauté until fragrant.\n3. Add chopped onions, garlic, ginger, and green chilies. Cook until onions are golden brown.\n4. Stir in chopped tomatoes and cook until they soften.\n5. Add mixed vegetables and cook for a few minutes.\n6. Add ground spices (ground coriander, ground cumin, turmeric powder, garam masala) and salt. Mix well.\n7. In a separate pot, boil water and add soaked rice. Cook until rice is 70% done. Drain and set aside.\n8. Layer the vegetable mixture and rice in the pan. Top with fried onions, mint leaves, and cilantro leaves.\n9. If using saffron, soak it in warm milk and drizzle over the layers.\n10. Cover the pan tightly and cook on low heat for 15-20 minutes until the rice is fully cooked and aromatic.\n11. Serve hot with raita or yogurt.",
      "favorite": false,
      "imageName": "vegetable_biryani",
      "description": "A fragrant and colorful Indian rice dish cooked with a variety of vegetables and aromatic spices, layered with fluffy basmati rice, and garnished with fried onions and fresh herbs, a delightful vegetarian option for any occasion.",
      "protein": "8g",
      "carbohydrates": "60g",
      "fat": "12g",
      "fiber": "7g",
      "calcium": "120mg",
      "iron": "3.5mg"
    },
    {
      "countryName": "Spain",
      "category": "veg",
      "id": 13,
      "meal_name": "Gazpacho",
      "cooking_items": "Tomatoes, cucumber, bell pepper, onion, garlic, bread, olive oil, red wine vinegar, salt, black pepper",
      "duration": "15 minutes",
      "rating": 4.6,
      "how_to_cook": "1. Roughly chop tomatoes, cucumber, bell pepper, and onion.\n2. Place the chopped vegetables in a blender or food processor. Add garlic, bread (crust removed), olive oil, and red wine vinegar.\n3. Blend until smooth and well combined.\n4. Season with salt and black pepper to taste. Adjust the consistency by adding water if necessary.\n5. Chill the gazpacho in the refrigerator for at least 1 hour before serving.\n6. Serve cold, garnished with chopped vegetables or fresh herbs, if desired.",
      "favorite": true,
      "imageName": "gazpacho",
      "description": "A refreshing Spanish cold soup made from ripe tomatoes, cucumber, bell pepper, onion, garlic, olive oil, and bread, blended to perfection and served chilled, perfect for hot summer days.",
      "protein": "3g",
      "carbohydrates": "15g",
      "fat": "8g",
      "fiber": "3g",
      "calcium": "40mg",
      "iron": "1mg"
    },
    {
      "countryName": "Spain",
      "category": "veg",
      "id": 14,
      "meal_name": "Tortilla Española",
      "cooking_items": "Potatoes, eggs, onion, olive oil, salt",
      "duration": "40 minutes",
      "rating": 4.7,
      "how_to_cook": "1. Peel and thinly slice potatoes. Finely chop onions.\n2. Heat olive oil in a non-stick skillet over medium heat.\n3. Add sliced potatoes and onions to the skillet. Cook, stirring occasionally, until potatoes are tender but not browned.\n4. In a large bowl, beat eggs and season with salt.\n5. Remove the cooked potatoes and onions from the skillet and drain excess oil.\n6. Add the potatoes and onions to the beaten eggs and mix well.\n7. Heat a little more olive oil in the skillet. Pour the potato and egg mixture into the skillet.\n8. Cook over low heat, occasionally lifting the edges to allow uncooked eggs to flow underneath.\n9. Once the bottom is set and the top is slightly runny, flip the omelette using a plate or lid.\n10. Cook for a few more minutes until fully set.\n11. Slide the tortilla onto a serving plate and let it cool slightly before slicing.\n12. Serve warm or at room temperature.",
      "favorite": false,
      "imageName": "tortilla_espanola",
      "description": "A classic Spanish dish consisting of thinly sliced potatoes and onions bound together with beaten eggs, cooked until golden and set, creating a hearty and flavorful omelette, perfect for any meal.",
      "protein": "10g",
      "carbohydrates": "20g",
      "fat": "15g",
      "fiber": "3g",
      "calcium": "60mg",
      "iron": "2mg"
    },
    {
      "countryName": "Spain",
      "category": "non-veg",
      "id": 15,
      "meal_name": "Paella Valenciana",
      "cooking_items": "Rice, chicken pieces, rabbit meat, green beans, tomatoes, bell peppers, saffron threads, olive oil, garlic, onion, paprika, salt, pepper",
      "duration": "60 minutes",
      "rating": 4.8,
      "how_to_cook": "1. Heat olive oil in a paella pan over medium heat.\n2. Sauté chopped onion and minced garlic until translucent.\n3. Add chicken pieces and rabbit meat to the pan. Cook until browned on all sides.\n4. Stir in chopped tomatoes, sliced bell peppers, and green beans. Cook for a few minutes.\n5. Sprinkle paprika over the mixture and stir well.\n6. Add rice to the pan and stir to coat it with the oil and spices.\n7. Pour in enough chicken or vegetable broth to cover the rice. Add saffron threads for color and flavor.\n8. Season with salt and pepper to taste. Bring to a simmer.\n9. Let the paella cook for about 20-25 minutes, without stirring, until the rice is cooked and the liquid is absorbed.\n10. Remove from heat and let it rest for a few minutes before serving. Garnish with lemon wedges if desired.",
      "favorite": true,
      "imageName": "paella_valenciana",
      "description": "A traditional Spanish rice dish cooked in a wide, shallow pan, featuring a flavorful combination of chicken, rabbit meat, green beans, and bell peppers, infused with saffron, a classic and beloved dish from the Valencia region of Spain.",
      "protein": "25g",
      "carbohydrates": "40g",
      "fat": "15g",
      "fiber": "5g",
      "calcium": "80mg",
      "iron": "3mg"
    },
    {
      "countryName": "Spain",
      "category": "non-veg",
      "id": 16,
      "meal_name": "Gambas al Ajillo",
      "cooking_items": "Shrimp, olive oil, garlic, red pepper flakes, parsley, salt",
      "duration": "15 minutes",
      "rating": 4.7,
      "how_to_cook": "1. Heat olive oil in a large skillet over medium heat.\n2. Add minced garlic and red pepper flakes to the skillet. Cook until garlic is fragrant but not browned.\n3. Add shrimp to the skillet and cook until they turn pink and opaque, about 2-3 minutes on each side.\n4. Season with salt to taste.\n5. Sprinkle chopped parsley over the shrimp and toss to combine.\n6. Remove from heat and transfer the shrimp to a serving dish.\n7. Serve hot, garnished with additional parsley and lemon wedges if desired.",
      "favorite": false,
      "imageName": "gambas_al_ajillo",
      "description": "A classic Spanish tapa featuring tender shrimp cooked in olive oil with garlic and red pepper flakes, finished with a sprinkle of fresh parsley, bursting with bold flavors and perfect for sharing.",
      "protein": "20g",
      "carbohydrates": "2g",
      "fat": "10g",
      "fiber": "0g",
      "calcium": "60mg",
      "iron": "2.5mg"
    },
    {
      "countryName": "Spain",
      "category": "vegan",
      "id": 17,
      "meal_name": "Potato Tortilla",
      "cooking_items": "Potatoes, onions, olive oil, chickpea flour (besan), water, salt, pepper",
      "duration": "45 minutes",
      "rating": 4.5,
      "how_to_cook": "1. Peel and thinly slice potatoes and onions.\n2. Heat olive oil in a non-stick skillet over medium heat.\n3. Add potatoes and onions to the skillet. Cook, stirring occasionally, until potatoes are tender and onions are translucent, about 15-20 minutes.\n4. In a mixing bowl, whisk chickpea flour with water until smooth. Season with salt and pepper.\n5. Pour the chickpea flour mixture over the cooked potatoes and onions in the skillet. Stir gently to combine.\n6. Cook for another 5-7 minutes until the edges start to set.\n7. Place a large plate over the skillet and carefully flip the tortilla onto the plate.\n8. Slide the tortilla back into the skillet and cook for another 5-7 minutes until fully set and golden brown.\n9. Remove from heat and let it cool slightly before slicing into wedges.\n10. Serve warm or at room temperature as a delicious and hearty vegan Spanish dish.",
      "favorite": false,
      "imageName": "spanish_potato_tortilla",
      "description": "A traditional Spanish omelette made with layers of thinly sliced potatoes and onions, bound together with a chickpea flour mixture, resulting in a hearty and flavorful vegan alternative to the classic tortilla española.",
      "protein": "5g",
      "carbohydrates": "30g",
      "fat": "12g",
      "fiber": "4g",
      "calcium": "40mg",
      "iron": "2mg"
    },
    {
      "countryName": "Spain",
      "category": "vegan",
      "id": 18,
      "meal_name": "Patatas Bravas",
      "cooking_items": "Potatoes, olive oil, paprika, garlic powder, salt, pepper, tomato sauce, hot sauce (optional)",
      "duration": "45 minutes",
      "rating": 4.5,
      "how_to_cook": "1. Preheat the oven to 200°C (400°F).\n2. Peel and cut potatoes into small cubes.\n3. Toss the potato cubes in olive oil, paprika, garlic powder, salt, and pepper until evenly coated.\n4. Spread the seasoned potatoes on a baking sheet in a single layer.\n5. Bake for 30-35 minutes, flipping halfway through, until the potatoes are crispy and golden brown.\n6. While the potatoes are baking, prepare the sauce by combining tomato sauce with hot sauce (if using) in a small saucepan. Heat over medium heat until warmed through.\n7. Once the potatoes are done, transfer them to a serving dish.\n8. Drizzle the sauce over the potatoes or serve it on the side for dipping.\n9. Garnish with chopped parsley, if desired, and serve hot.",
      "favorite": false,
      "imageName": "patatas_bravas",
      "description": "A classic Spanish tapas dish featuring crispy roasted potatoes seasoned with paprika and garlic powder, served with a zesty tomato sauce, perfect for snacking or as a side dish, and suitable for vegans.",
      "protein": "3g",
      "carbohydrates": "25g",
      "fat": "10g",
      "fiber": "4g",
      "calcium": "20mg",
      "iron": "1mg"
    },
    {
        "countryName": "Canada",
        "category": "vegan",
        "id": 19,
        "meal_name": "Poutine",
        "cooking_items": "Potatoes, vegetable oil, vegan gravy (made from vegetable broth, flour, vegan butter, soy sauce), vegan cheese curds",
        "duration": "45 minutes",
        "rating": 4.7,
        "how_to_cook": "1. Wash and cut potatoes into thick fries.\n2. Heat vegetable oil in a deep fryer or large pot.\n3. Fry potatoes until golden and crispy, then drain excess oil.\n4. In a saucepan, prepare vegan gravy by combining vegetable broth, flour, vegan butter, and soy sauce. Cook until thickened.\n5. Place fried potatoes in a serving dish, top with vegan cheese curds.\n6. Pour hot vegan gravy over the potatoes and cheese curds.\n7. Serve immediately while hot and enjoy!",
        "description": "Poutine is a beloved Canadian dish consisting of crispy fries topped with savory gravy and cheese curds. This vegan version replaces traditional cheese curds with vegan cheese alternatives, making it suitable for plant-based diets.",
        "protein": "5g",
        "carbohydrates": "30g",
        "fat": "15g",
        "fiber": "3g",
        "calcium": "40mg",
        "iron": "2mg",
        "favorite": false,
        "imageName": "poutine"
    },
    {
        "countryName": "Canada",
        "category": "vegan",
        "id": 20,
        "meal_name": "Nanaimo Bars",
        "cooking_items": "Graham cracker crumbs, shredded coconut, vegan butter, powdered sugar, cocoa powder, almond milk, vanilla extract, vegan chocolate chips",
        "duration": "1 hour",
        "rating": 4.8,
        "how_to_cook": "1. Mix graham cracker crumbs, shredded coconut, melted vegan butter, powdered sugar, cocoa powder, almond milk, and vanilla extract in a bowl until well combined.\n2. Press the mixture into the bottom of a square baking dish and chill in the refrigerator for 30 minutes.\n3. In a saucepan, melt vegan chocolate chips with a little vegan butter until smooth.\n4. Pour the melted chocolate mixture over the chilled base layer.\n5. Return to the refrigerator and chill until the chocolate is set.\n6. Once set, cut into squares and serve chilled.",
        "description": "Nanaimo Bars are a classic Canadian dessert made of three layers: a crumbly coconut and graham cracker base, a creamy custard-flavored center, and a rich chocolate topping. This vegan version substitutes traditional dairy ingredients with plant-based alternatives, retaining the delicious taste and texture.",
        "protein": "2g",
        "carbohydrates": "35g",
        "fat": "20g",
        "fiber": "4g",
        "calcium": "30mg",
        "iron": "1.5mg",
        "favorite": true,
        "imageName": "nanaimo_bars"
    },
    {
        "countryName": "Canada",
        "category": "non-veg",
        "id": 21,
        "meal_name": "Maple Glazed Salmon",
        "cooking_items": "Salmon fillets, maple syrup, soy sauce, garlic, lemon juice, olive oil, salt, black pepper",
        "duration": "30 minutes",
        "rating": 4.6,
        "how_to_cook": "1. Preheat the oven to 400°F (200°C).\n2. In a bowl, mix together maple syrup, soy sauce, minced garlic, lemon juice, olive oil, salt, and black pepper.\n3. Place salmon fillets on a baking sheet lined with parchment paper.\n4. Brush the maple glaze mixture generously over the salmon.\n5. Bake for 15-20 minutes or until the salmon is cooked through and flakes easily with a fork.\n6. Serve hot, garnished with fresh herbs if desired.",
        "description": "Maple Glazed Salmon is a Canadian delicacy that combines the richness of salmon with the sweetness of maple syrup. The salmon fillets are marinated in a flavorful maple glaze and baked to perfection, resulting in a tender and flavorful dish.",
        "protein": "25g",
        "carbohydrates": "10g",
        "fat": "15g",
        "fiber": "1g",
        "calcium": "30mg",
        "iron": "1.2mg",
        "favorite": false,
        "imageName": "maple_glazed_salmon"
    },
    {
        "countryName": "Canada",
        "category": "non-veg",
        "id": 22,
        "meal_name": "Tourtière",
        "cooking_items": "Ground pork, onions, garlic, potatoes, pie crust, spices (such as cinnamon, cloves, allspice), beef or vegetable broth",
        "duration": "2 hours",
        "rating": 4.9,
        "how_to_cook": "1. Preheat the oven to 375°F (190°C).\n2. In a skillet, cook ground pork, onions, and garlic until the meat is browned and onions are soft.\n3. Stir in diced potatoes and spices (cinnamon, cloves, allspice).\n4. Add beef or vegetable broth and simmer until the potatoes are tender and the mixture thickens.\n5. Pour the mixture into a pie crust and cover with another pie crust.\n6. Bake for 45-50 minutes or until the crust is golden brown.\n7. Let it cool for a few minutes before serving.",
        "description": "Tourtière is a traditional Canadian meat pie originating from Quebec. It features a savory filling made with ground pork, onions, and spices, encased in a flaky pie crust. This hearty dish is a staple during festive occasions and family gatherings.",
        "protein": "20g",
        "carbohydrates": "30g",
        "fat": "18g",
        "fiber": "3g",
        "calcium": "40mg",
        "iron": "2.5mg",
        "favorite": true,
        "imageName": "tourtiere"
    },
    {
        "countryName": "Canada",
        "category": "veg",
        "id": 23,
        "meal_name": "Butter Tarts",
        "cooking_items": "Flour, butter, brown sugar, corn syrup, vanilla extract, raisins (optional)",
        "duration": "1 hour",
        "rating": 4.6,
        "how_to_cook": "1. Preheat the oven to 375°F (190°C).\n2. In a mixing bowl, cream together butter and brown sugar until smooth.\n3. Stir in corn syrup and vanilla extract until well combined.\n4. Fold in flour until a dough forms.\n5. Divide the dough into small balls and press into tart molds.\n6. If desired, place raisins in the center of each tart.\n7. Bake for 12-15 minutes or until the crust is golden brown.\n8. Let the tarts cool before serving.",
        "description": "Vegetarian Butter Tarts are a classic Canadian dessert consisting of a flaky pastry crust filled with a sweet and gooey mixture of butter, brown sugar, and corn syrup. This vegetarian version of the popular treat omits any meat-based ingredients, making it suitable for vegetarians.",
        "protein": "2g",
        "carbohydrates": "30g",
        "fat": "15g",
        "fiber": "1g",
        "calcium": "20mg",
        "iron": "1mg",
        "favorite": false,
        "imageName": "vegetarian_butter_tarts"
    },
    {
        "countryName": "Canada",
        "category": "veg",
        "id": 24,
        "meal_name": "Maple Baked Beans",
        "cooking_items": "Dried white beans, maple syrup, tomato paste, onion, garlic, mustard, apple cider vinegar, salt, pepper",
        "duration": "6 hours",
        "rating": 4.7,
        "how_to_cook": "1. Rinse and soak dried white beans in water overnight.\n2. Drain and rinse the soaked beans.\n3. In a large pot, combine the soaked beans, maple syrup, tomato paste, diced onion, minced garlic, mustard, apple cider vinegar, salt, and pepper.\n4. Add enough water to cover the beans by about an inch.\n5. Bring the mixture to a boil, then reduce the heat to low and simmer for 4-5 hours, stirring occasionally, until the beans are tender and the sauce is thickened.\n6. Adjust seasoning to taste.\n7. Serve hot as a delicious and hearty vegetarian dish.",
        "description": "Vegetarian Maple Baked Beans are a Canadian comfort food staple, featuring tender white beans cooked in a sweet and tangy maple-infused sauce. This vegetarian version omits traditional bacon or pork, making it suitable for vegetarians while still offering the rich flavors of the classic dish.",
        "protein": "10g",
        "carbohydrates": "50g",
        "fat": "1g",
        "fiber": "12g",
        "calcium": "80mg",
        "iron": "3.5mg",
        "favorite": true,
        "imageName": "vegetarian_maple_baked_beans"
    },
    {
        "countryName": "USA",
        "category": "veg",
        "id": 25,
        "meal_name": "Vegetarian Chili",
        "cooking_items": "Kidney beans, black beans, diced tomatoes, bell peppers, onions, garlic, chili powder, cumin, paprika, vegetable broth",
        "duration": "1 hour",
        "rating": 4.9,
        "how_to_cook": "1. In a large pot, sauté diced onions, bell peppers, and minced garlic until softened.\n2. Add chili powder, cumin, and paprika to the pot and cook for another minute to toast the spices.\n3. Stir in kidney beans, black beans, diced tomatoes, and vegetable broth.\n4. Bring the mixture to a boil, then reduce the heat and let it simmer for about 30-40 minutes, stirring occasionally, until the chili thickens.\n5. Season with salt and pepper to taste.\n6. Serve hot topped with your favorite garnishes such as shredded cheese, sour cream, avocado, and chopped cilantro.",
        "description": "Vegetarian Chili is a hearty and flavorful dish made with a variety of beans, tomatoes, and aromatic spices. This meatless version of the classic chili is packed with protein and fiber, making it a satisfying and nutritious meal.",
        "protein": "15g",
        "carbohydrates": "40g",
        "fat": "5g",
        "fiber": "12g",
        "calcium": "80mg",
        "iron": "3mg",
        "favorite": true,
        "imageName": "vegetarian_chili"
    },
    {
        "countryName": "USA",
        "category": "veg",
        "id": 26,
        "meal_name": "Cobb Salad",
        "cooking_items": "Romaine lettuce, cherry tomatoes, cucumber, avocado, hard-boiled eggs, blue cheese (or vegan blue cheese), red onion, balsamic vinaigrette",
        "duration": "20 minutes",
        "rating": 4.7,
        "how_to_cook": "1. Wash and chop romaine lettuce into bite-sized pieces.\n2. Arrange chopped lettuce in a salad bowl or on a serving platter.\n3. Top the lettuce with halved cherry tomatoes, sliced cucumber, diced avocado, sliced hard-boiled eggs, crumbled blue cheese (or vegan blue cheese), and thinly sliced red onion.\n4. Drizzle balsamic vinaigrette over the salad.\n5. Toss gently to combine.\n6. Serve immediately as a refreshing and nutritious meal.",
        "description": "Vegetarian Cobb Salad is a classic American salad featuring a colorful array of fresh vegetables, protein-rich eggs, creamy avocado, and tangy blue cheese. This vegetarian version offers all the delicious flavors and textures of the traditional Cobb salad without the addition of meat.",
        "protein": "12g",
        "carbohydrates": "20g",
        "fat": "15g",
        "fiber": "8g",
        "calcium": "60mg",
        "iron": "2mg",
        "favorite": false,
        "imageName": "vegetarian_cobb_salad"
    },
    {
        "countryName": "USA",
        "category": "vegan",
        "id": 27,
        "meal_name": "BBQ Jackfruit Sandwich",
        "cooking_items": "Canned young green jackfruit, barbecue sauce, hamburger buns, coleslaw (cabbage, carrots, vegan mayonnaise, apple cider vinegar, sugar, salt, pepper)",
        "duration": "40 minutes",
        "rating": 4.8,
        "how_to_cook": "1. Drain and rinse canned young green jackfruit.\n2. Using your hands or a fork, shred the jackfruit into small pieces.\n3. In a skillet, sauté the shredded jackfruit until slightly browned.\n4. Pour barbecue sauce over the jackfruit and simmer for 10-15 minutes.\n5. Toast hamburger buns.\n6. Assemble sandwiches by placing a generous portion of the BBQ jackfruit on the bottom bun, topping with coleslaw, and covering with the top bun.\n7. Serve hot and enjoy!",
        "description": "Vegan BBQ Jackfruit Sandwich is a popular vegan twist on the classic pulled pork sandwich. Young green jackfruit mimics the texture of pulled pork when cooked and flavored with barbecue sauce. Served with a tangy coleslaw, this sandwich is a delicious and satisfying vegan meal.",
        "protein": "5g",
        "carbohydrates": "40g",
        "fat": "3g",
        "fiber": "6g",
        "calcium": "40mg",
        "iron": "1.8mg",
        "favorite": true,
        "imageName": "vegan_bbq_jackfruit_sandwich"
    },
    {
        "countryName": "USA",
        "category": "vegan",
        "id": 28,
        "meal_name": "Caesar Salad",
        "cooking_items": "Romaine lettuce, vegan Caesar dressing (made from cashews, lemon juice, garlic, Dijon mustard, capers, nutritional yeast), croutons, vegan parmesan cheese",
        "duration": "15 minutes",
        "rating": 4.7,
        "how_to_cook": "1. Wash and chop romaine lettuce into bite-sized pieces.\n2. In a blender, combine cashews, lemon juice, minced garlic, Dijon mustard, capers, nutritional yeast, and water. Blend until smooth to make the vegan Caesar dressing.\n3. Toss the chopped lettuce with the vegan Caesar dressing until evenly coated.\n4. Top the salad with croutons and vegan parmesan cheese.\n5. Serve immediately as a refreshing and flavorful appetizer or side dish.",
        "description": "Vegan Caesar Salad is a plant-based twist on the classic Caesar salad, featuring crisp romaine lettuce tossed in a creamy vegan Caesar dressing and topped with crunchy croutons and dairy-free parmesan cheese. This refreshing salad is packed with flavor and perfect for vegans and non-vegans alike.",
        "protein": "3g",
        "carbohydrates": "10g",
        "fat": "7g",
        "fiber": "2g",
        "calcium": "40mg",
        "iron": "1.2mg",
        "favorite": false,
        "imageName": "vegan_caesar_salad"
    },
    {
        "countryName": "USA",
        "category": "non-veg",
        "id": 29,
        "meal_name": "Classic Cheeseburger",
        "cooking_items": "Ground beef, hamburger buns, cheese slices, lettuce, tomato, onion, pickles, ketchup, mustard, mayonnaise",
        "duration": "20 minutes",
        "rating": 4.9,
        "how_to_cook": "1. Divide ground beef into patties and season with salt and pepper.\n2. Heat a grill or skillet over medium-high heat.\n3. Cook the burger patties for about 3-4 minutes per side for medium-rare, or until desired doneness.\n4. Toast hamburger buns on the grill or skillet.\n5. Assemble burgers by placing lettuce, tomato, onion, pickles, and cheese on the bottom bun.\n6. Add the cooked burger patty on top.\n7. Spread ketchup, mustard, and mayonnaise on the top bun.\n8. Place the top bun over the burger.\n9. Serve hot with fries or chips, and enjoy!",
        "description": "Classic Cheeseburger is an iconic American dish featuring a juicy beef patty topped with melted cheese, fresh vegetables, and condiments, all sandwiched between soft hamburger buns. It's a timeless favorite enjoyed by many across the USA.",
        "protein": "25g",
        "carbohydrates": "30g",
        "fat": "20g",
        "fiber": "2g",
        "calcium": "100mg",
        "iron": "2.5mg",
        "favorite": true,
        "imageName": "classic_cheeseburger"
    },
    {
        "countryName": "USA",
        "category": "non-veg",
        "id": 30,
        "meal_name": "Southern Fried Chicken",
        "cooking_items": "Chicken pieces (such as thighs, drumsticks), buttermilk, all-purpose flour, salt, black pepper, paprika, garlic powder, onion powder, vegetable oil",
        "duration": "1 hour",
        "rating": 4.8,
        "how_to_cook": "1. Marinate chicken pieces in buttermilk for at least 30 minutes, or overnight for best results.\n2. In a shallow dish, mix together all-purpose flour, salt, black pepper, paprika, garlic powder, and onion powder.\n3. Dredge marinated chicken pieces in the seasoned flour mixture, shaking off any excess.\n4. Heat vegetable oil in a deep skillet or Dutch oven to 350°F (175°C).\n5. Carefully add chicken pieces to the hot oil, making sure not to overcrowd the skillet.\n6. Fry chicken for about 10-12 minutes per side, or until golden brown and cooked through.\n7. Drain fried chicken on paper towels to remove excess oil.\n8. Serve hot with your favorite sides such as mashed potatoes, coleslaw, or biscuits.",
        "description": "Southern Fried Chicken is a classic Southern American dish known for its crispy and flavorful coating. Chicken pieces are marinated in buttermilk, coated in seasoned flour, and deep-fried to perfection. It's a delicious comfort food enjoyed by many.",
        "protein": "30g",
        "carbohydrates": "15g",
        "fat": "25g",
        "fiber": "1g",
        "calcium": "30mg",
        "iron": "2mg",
        "favorite": true,
        "imageName": "southern_fried_chicken"
    },
    {
        "countryName": "France",
        "category": "veg",
        "id": 31,
        "meal_name": "Ratatouille",
        "cooking_items": "Eggplant, zucchini, bell peppers, tomatoes, onion, garlic, olive oil, thyme, basil, salt, pepper",
        "duration": "1 hour",
        "rating": 4.9,
        "how_to_cook": "1. Slice eggplant, zucchini, and bell peppers into rounds or chunks.\n2. Dice tomatoes, onion, and garlic.\n3. In a large skillet or Dutch oven, heat olive oil over medium heat.\n4. Sauté onions and garlic until softened.\n5. Add eggplant, zucchini, and bell peppers to the skillet, and cook until slightly tender.\n6. Stir in diced tomatoes, thyme, basil, salt, and pepper.\n7. Cover and simmer for 20-30 minutes, stirring occasionally, until vegetables are cooked through.\n8. Adjust seasoning if needed and serve hot as a delicious and nutritious vegetarian dish.",
        "description": "Ratatouille is a classic French vegetable stew made with a colorful array of eggplant, zucchini, bell peppers, tomatoes, onions, and garlic. This vegetarian dish is bursting with flavor and is perfect for showcasing the fresh produce of the Mediterranean region.",
        "protein": "4g",
        "carbohydrates": "20g",
        "fat": "10g",
        "fiber": "6g",
        "calcium": "60mg",
        "iron": "2mg",
        "favorite": true,
        "imageName": "ratatouille"
    },
    {
        "countryName": "France",
        "category": "veg",
        "id": 32,
        "meal_name": "Quiche Lorraine",
        "cooking_items": "Pie crust, eggs, milk, cream, Gruyère cheese, bacon (optional), onion, nutmeg, salt, pepper",
        "duration": "1 hour",
        "rating": 4.7,
        "how_to_cook": "1. Preheat the oven to 375°F (190°C).\n2. Roll out the pie crust and press it into a pie dish.\n3. In a bowl, whisk together eggs, milk, and cream.\n4. Stir in grated Gruyère cheese, cooked bacon (optional), finely chopped onion, nutmeg, salt, and pepper.\n5. Pour the mixture into the pie crust.\n6. Bake for 35-40 minutes or until the quiche is set and golden brown.\n7. Let it cool for a few minutes before slicing and serving.",
        "description": "Quiche Lorraine is a traditional French savory tart made with a rich and creamy egg custard filling flavored with Gruyère cheese, bacon, and onions. This vegetarian version omits the bacon, making it a delicious meat-free option for brunch, lunch, or dinner.",
        "protein": "10g",
        "carbohydrates": "25g",
        "fat": "15g",
        "fiber": "2g",
        "calcium": "120mg",
        "iron": "2.5mg",
        "favorite": false,
        "imageName": "quiche_lorraine"
    },
    {
        "countryName": "France",
        "category": "vegan",
        "id": 33,
        "meal_name": "Salade Niçoise",
        "cooking_items": "Romaine lettuce, cherry tomatoes, cucumber, olives, red onion, capers, green beans, boiled potatoes, Dijon mustard vinaigrette (Dijon mustard, olive oil, red wine vinegar, garlic, salt, pepper)",
        "duration": "20 minutes",
        "rating": 4.8,
        "how_to_cook": "1. Wash and chop romaine lettuce into bite-sized pieces.\n2. Arrange chopped lettuce in a salad bowl or on a serving platter.\n3. Top the lettuce with halved cherry tomatoes, sliced cucumber, olives, thinly sliced red onion, capers, blanched green beans, and boiled potatoes.\n4. Drizzle Dijon mustard vinaigrette over the salad.\n5. Serve immediately as a refreshing and nutritious vegan meal.",
        "description": "Salade Niçoise is a classic French salad originating from the city of Nice. This vegan version features a colorful array of fresh vegetables including lettuce, tomatoes, cucumber, olives, red onion, green beans, and boiled potatoes, all dressed with a zesty Dijon mustard vinaigrette.",
        "protein": "5g",
        "carbohydrates": "25g",
        "fat": "10g",
        "fiber": "8g",
        "calcium": "60mg",
        "iron": "2.5mg",
        "favorite": true,
        "imageName": "salade_nicoise"
    },
    {
        "countryName": "France",
        "category": "vegan",
        "id": 34,
        "meal_name": "French Onion Soup",
        "cooking_items": "Onions, vegetable broth, olive oil, bread, vegan cheese, thyme, bay leaf, salt, pepper",
        "duration": "1 hour 30 minutes",
        "rating": 4.7,
        "how_to_cook": "1. Thinly slice onions.\n2. In a large pot, heat olive oil over medium-low heat.\n3. Add sliced onions to the pot and cook slowly, stirring occasionally, until caramelized and golden brown, about 45-60 minutes.\n4. Add vegetable broth, thyme, and a bay leaf to the pot.\n5. Simmer for another 20-30 minutes to allow flavors to meld.\n6. Toast bread slices.\n7. Ladle soup into oven-safe bowls, top with toasted bread, and sprinkle with vegan cheese.\n8. Place bowls under the broiler until the cheese is melted and bubbly.\n9. Serve hot and enjoy!",
        "description": "Vegan French Onion Soup is a plant-based twist on the classic French comfort food. Caramelized onions simmered in flavorful vegetable broth, topped with toasted bread and vegan cheese, create a hearty and satisfying soup that's perfect for any occasion.",
        "protein": "5g",
        "carbohydrates": "30g",
        "fat": "8g",
        "fiber": "4g",
        "calcium": "80mg",
        "iron": "2mg",
        "favorite": false,
        "imageName": "vegan_french_onion_soup"
    },
    {
        "countryName": "France",
        "category": "non-veg",
        "id": 35,
        "meal_name": "Coq au Vin",
        "cooking_items": "Chicken, red wine, mushrooms, onions, carrots, garlic, bacon, thyme, bay leaf, butter, flour, salt, pepper",
        "duration": "2 hours 30 minutes",
        "rating": 4.8,
        "how_to_cook": "1. Marinate chicken pieces in red wine, garlic, thyme, and bay leaf for at least 4 hours or overnight.\n2. In a Dutch oven, cook diced bacon until crispy. Remove bacon and set aside.\n3. Brown marinated chicken pieces in the bacon fat.\n4. Remove chicken from the Dutch oven and sauté chopped onions, carrots, and mushrooms until softened.\n5. Return chicken and bacon to the Dutch oven. Pour in the marinating liquid and enough chicken broth to cover.\n6. Simmer, covered, over low heat for about 1.5-2 hours, until chicken is tender.\n7. In a separate pan, make a roux by melting butter and whisking in flour until smooth. Stir the roux into the Coq au Vin to thicken the sauce.\n8. Season with salt and pepper to taste.\n9. Serve hot with crusty bread or over mashed potatoes.",
        "description": "Coq au Vin is a classic French stew featuring chicken braised in red wine with mushrooms, onions, carrots, garlic, and bacon. This rich and flavorful dish is a beloved French comfort food that is perfect for special occasions or cozy dinners.",
        "protein": "30g",
        "carbohydrates": "15g",
        "fat": "20g",
        "fiber": "3g",
        "calcium": "60mg",
        "iron": "3.5mg",
        "favorite": true,
        "imageName": "coq_au_vin"
    },
    {
        "countryName": "France",
        "category": "non-veg",
        "id": 36,
        "meal_name": "Boeuf Bourguignon",
        "cooking_items": "Beef, red wine, mushrooms, onions, carrots, garlic, bacon, thyme, bay leaf, butter, flour, salt, pepper",
        "duration": "3 hours",
        "rating": 4.9,
        "how_to_cook": "1. Marinate beef chunks in red wine, garlic, thyme, and bay leaf for at least 4 hours or overnight.\n2. In a Dutch oven, cook diced bacon until crispy. Remove bacon and set aside.\n3. Brown marinated beef chunks in the bacon fat.\n4. Remove beef from the Dutch oven and sauté chopped onions, carrots, and mushrooms until softened.\n5. Return beef and bacon to the Dutch oven. Pour in the marinating liquid and enough beef broth to cover.\n6. Simmer, covered, over low heat for about 2.5-3 hours, until beef is tender.\n7. In a separate pan, make a roux by melting butter and whisking in flour until smooth. Stir the roux into the Boeuf Bourguignon to thicken the sauce.\n8. Season with salt and pepper to taste.\n9. Serve hot with crusty bread or over mashed potatoes.",
        "description": "Boeuf Bourguignon is a classic French beef stew cooked in red wine with mushrooms, onions, carrots, garlic, and bacon. This hearty and flavorful dish is a staple of French cuisine, often served during the colder months for a comforting and satisfying meal.",
        "protein": "35g",
        "carbohydrates": "20g",
        "fat": "25g",
        "fiber": "4g",
        "calcium": "80mg",
        "iron": "4mg",
        "favorite": true,
        "imageName": "boeuf_bourguignon"
    },
    {
        "countryName": "Japan",
        "category": "veg",
        "id": 37,
        "meal_name": "Vegetable Tempura",
        "cooking_items": "Assorted vegetables (such as sweet potato, eggplant, bell pepper, broccoli, mushroom), tempura batter (flour, water, ice cubes), vegetable oil for frying, dipping sauce (soy sauce, mirin, dashi)",
        "duration": "30 minutes",
        "rating": 4.8,
        "how_to_cook": "1. Prepare the vegetables by slicing them into bite-sized pieces.\n2. In a bowl, mix flour and ice-cold water to create a smooth batter.\n3. Heat vegetable oil in a deep fryer or large pot.\n4. Dip the vegetables in the tempura batter and gently place them into the hot oil.\n5. Fry until golden brown and crispy, then remove and drain on paper towels.\n6. Serve hot with dipping sauce on the side.",
        "description": "Vegetable Tempura is a popular Japanese dish consisting of assorted vegetables coated in a light and crispy tempura batter and deep-fried until golden brown. This vegetarian dish is enjoyed as a snack, appetizer, or side dish in Japanese cuisine.",
        "protein": "3g",
        "carbohydrates": "20g",
        "fat": "10g",
        "fiber": "3g",
        "calcium": "20mg",
        "iron": "1.5mg",
        "favorite": true,
        "imageName": "vegetable_tempura"
    },
    {
        "countryName": "Japan",
        "category": "veg",
        "id": 38,
        "meal_name": "Sushi Rolls (Maki)",
        "cooking_items": "Sushi rice, nori (seaweed sheets), assorted vegetables (such as cucumber, avocado, carrot, bell pepper, radish), rice vinegar, sugar, salt, soy sauce, pickled ginger, wasabi",
        "duration": "45 minutes",
        "rating": 4.7,
        "how_to_cook": "1. Cook sushi rice according to package instructions.\n2. In a small bowl, mix rice vinegar, sugar, and salt.\n3. Spread cooked rice onto a nori sheet, leaving a border around the edges.\n4. Place thinly sliced or julienned vegetables in a line along the edge of the rice.\n5. Roll the nori sheet tightly around the vegetables using a bamboo sushi mat.\n6. Wet the edge of the nori sheet with a little water to seal the roll.\n7. Slice the roll into bite-sized pieces using a sharp knife.\n8. Serve with soy sauce, pickled ginger, and wasabi.",
        "description": "Vegetable Sushi Rolls, also known as Maki, are a staple of Japanese cuisine. These rolls are made with sushi rice, nori seaweed sheets, and assorted vegetables such as cucumber, avocado, carrot, and bell pepper. Vegetable sushi rolls are a delicious and healthy vegetarian option for sushi lovers.",
        "protein": "4g",
        "carbohydrates": "30g",
        "fat": "2g",
        "fiber": "5g",
        "calcium": "30mg",
        "iron": "2mg",
        "favorite": true,
        "imageName": "vegetable_sushi_rolls"
    },
    {
        "countryName": "Japan",
        "category": "vegan",
        "id": 39,
        "meal_name": "Vegetable Ramen",
        "cooking_items": "Ramen noodles, vegetable broth, tofu, mushrooms, nori (seaweed), green onions, garlic, ginger, soy sauce, miso paste, sesame oil, sesame seeds",
        "duration": "45 minutes",
        "rating": 4.7,
        "how_to_cook": "1. Cook ramen noodles according to package instructions.\n2. In a pot, heat vegetable broth over medium heat.\n3. Add sliced tofu, sliced mushrooms, minced garlic, grated ginger, soy sauce, and miso paste to the broth.\n4. Simmer for 15-20 minutes until tofu and mushrooms are cooked through and flavors are well combined.\n5. Cook nori sheets briefly in the oven or toaster until crispy, then crumble into small pieces.\n6. Divide cooked noodles into serving bowls.\n7. Ladle hot broth, tofu, and mushrooms over the noodles.\n8. Garnish with sliced green onions, toasted sesame oil, sesame seeds, and crumbled nori.\n9. Serve hot and enjoy!",
        "description": "Vegetable Ramen is a comforting and flavorful Japanese noodle soup made with hearty vegetables, tofu, and savory broth. This vegan version of ramen is packed with umami flavors and is perfect for warming up on chilly days.",
        "protein": "10g",
        "carbohydrates": "30g",
        "fat": "5g",
        "fiber": "6g",
        "calcium": "60mg",
        "iron": "3mg",
        "favorite": true,
        "imageName": "vegetable_ramen"
    },
    {
        "countryName": "Japan",
        "category": "vegan",
        "id": 40,
        "meal_name": "Vegetable Gyoza",
        "cooking_items": "Gyoza wrappers, cabbage, carrots, mushrooms, garlic, ginger, green onions, soy sauce, sesame oil, rice vinegar",
        "duration": "45 minutes",
        "rating": 4.6,
        "how_to_cook": "1. Finely chop cabbage, carrots, mushrooms, garlic, ginger, and green onions.\n2. In a large bowl, mix chopped vegetables with soy sauce, sesame oil, and rice vinegar.\n3. Place a spoonful of the vegetable mixture onto a gyoza wrapper.\n4. Moisten the edges of the wrapper with water and fold in half, pressing to seal.\n5. Heat a skillet over medium heat and add a small amount of oil.\n6. Arrange gyoza in the skillet in a single layer, making sure they don't touch each other.\n7. Cook until the bottom is golden brown, then add a small amount of water to the skillet and cover with a lid.\n8. Steam for 5-7 minutes until the wrappers are translucent and the filling is cooked through.\n9. Serve hot with soy sauce for dipping.",
        "description": "Vegetable Gyoza, also known as potstickers, are Japanese dumplings filled with a savory mixture of cabbage, carrots, mushrooms, garlic, and ginger. These vegan gyoza are pan-fried until crispy on the bottom and steamed to perfection, resulting in a delicious appetizer or main dish.",
        "protein": "6g",
        "carbohydrates": "25g",
        "fat": "5g",
        "fiber": "4g",
        "calcium": "40mg",
        "iron": "2mg",
        "favorite": false,
        "imageName": "vegetable_gyoza"
    },
    {
        "countryName": "Japan",
        "category": "non-veg",
        "id": 41,
        "meal_name": "Sushi",
        "cooking_items": "Sushi rice, raw fish (such as tuna, salmon, yellowtail), nori (seaweed sheets), vegetables (such as cucumber, avocado), soy sauce, wasabi, pickled ginger",
        "duration": "30 minutes",
        "rating": 4.9,
        "how_to_cook": "1. Cook sushi rice according to package instructions.\n2. Slice raw fish and vegetables into thin strips.\n3. Place a sheet of nori on a bamboo sushi mat.\n4. Spread a thin layer of sushi rice evenly over the nori, leaving a small border at the top.\n5. Arrange slices of fish and vegetables in the center of the rice.\n6. Roll the sushi tightly using the bamboo mat, pressing gently to seal.\n7. Slice the sushi roll into bite-sized pieces using a sharp knife.\n8. Serve with soy sauce, wasabi, and pickled ginger.",
        "description": "Sushi is a traditional Japanese dish consisting of vinegared rice topped with raw fish, vegetables, or other ingredients. It is often served with soy sauce, wasabi, and pickled ginger. Sushi comes in various forms such as nigiri, maki, and sashimi, and is enjoyed worldwide for its freshness and flavor.",
        "protein": "20g",
        "carbohydrates": "40g",
        "fat": "5g",
        "fiber": "3g",
        "calcium": "40mg",
        "iron": "2mg",
        "favorite": true,
        "imageName": "sushi"
    },
    {
        "countryName": "Japan",
        "category": "non-veg",
        "id": 42,
        "meal_name": "Tonkatsu",
        "cooking_items": "Pork cutlets (or chicken cutlets), panko breadcrumbs, eggs, flour, cabbage, tonkatsu sauce, rice",
        "duration": "45 minutes",
        "rating": 4.7,
        "how_to_cook": "1. Season pork cutlets with salt and pepper.\n2. Dredge each cutlet in flour, then dip into beaten eggs, and coat with panko breadcrumbs.\n3. Heat oil in a deep fryer or skillet over medium heat.\n4. Fry the breaded cutlets until golden brown and cooked through, about 5-7 minutes per side.\n5. Drain on paper towels to remove excess oil.\n6. Slice cabbage thinly and serve alongside the tonkatsu.\n7. Serve tonkatsu hot with tonkatsu sauce and steamed rice.",
        "description": "Tonkatsu is a popular Japanese dish consisting of breaded and deep-fried pork cutlets. The pork is typically coated with panko breadcrumbs to achieve a crispy texture. Tonkatsu is served with shredded cabbage and tonkatsu sauce, and is often enjoyed with steamed rice.",
        "protein": "25g",
        "carbohydrates": "30g",
        "fat": "15g",
        "fiber": "2g",
        "calcium": "50mg",
        "iron": "2.5mg",
        "favorite": true,
        "imageName": "tonkatsu"
    },
    {
        "countryName": "Mexico",
        "category": "veg",
        "id": 43,
        "meal_name": "Vegetarian Tacos",
        "cooking_items": "Corn tortillas, black beans, avocado, tomatoes, onion, cilantro, lime, jalapeno (optional), lettuce, salsa",
        "duration": "30 minutes",
        "rating": 4.8,
        "how_to_cook": "1. Warm corn tortillas on a skillet or griddle.\n2. Heat black beans in a saucepan.\n3. Dice avocado, tomatoes, onion, and jalapeno (if using).\n4. Assemble tacos by filling each tortilla with black beans, diced vegetables, chopped cilantro, and a squeeze of lime juice.\n5. Top with lettuce and salsa.\n6. Serve hot and enjoy!",
        "description": "Vegetarian Tacos are a staple of Mexican cuisine, featuring corn tortillas filled with flavorful black beans, fresh avocado, tomatoes, onions, cilantro, and lime. These tacos are versatile, customizable, and bursting with delicious flavors.",
        "protein": "8g",
        "carbohydrates": "25g",
        "fat": "10g",
        "fiber": "6g",
        "calcium": "40mg",
        "iron": "2mg",
        "favorite": true,
        "imageName": "vegetarian_tacos"
    },
    {
        "countryName": "Mexico",
        "category": "veg",
        "id": 44,
        "meal_name": "Vegetarian Enchiladas",
        "cooking_items": "Corn tortillas, black beans, cheese, onion, garlic, enchilada sauce, cilantro, avocado, sour cream (optional)",
        "duration": "45 minutes",
        "rating": 4.7,
        "how_to_cook": "1. Preheat the oven to 350°F (175°C).\n2. In a skillet, sauté diced onion and minced garlic until softened.\n3. Add black beans and a portion of enchilada sauce to the skillet and cook until heated through.\n4. Warm corn tortillas on a skillet or in the microwave.\n5. Spoon the bean mixture onto each tortilla and roll them up.\n6. Place the rolled enchiladas seam-side down in a baking dish.\n7. Pour the remaining enchilada sauce over the enchiladas and sprinkle with cheese.\n8. Bake in the preheated oven for 20-25 minutes, until the cheese is melted and bubbly.\n9. Garnish with chopped cilantro and sliced avocado.\n10. Serve hot with optional sour cream on the side.",
        "description": "Vegetarian Enchiladas are a delicious and satisfying Mexican dish made with corn tortillas filled with black beans, cheese, onions, and garlic, then topped with enchilada sauce and baked until bubbly. This flavorful meal is perfect for a family dinner or a casual gathering with friends.",
        "protein": "12g",
        "carbohydrates": "30g",
        "fat": "15g",
        "fiber": "8g",
        "calcium": "120mg",
        "iron": "3mg",
        "favorite": false,
        "imageName": "vegetarian_enchiladas"
    },
    {
        "countryName": "Mexico",
        "category": "vegan",
        "id": 45,
        "meal_name": "Vegan Tamales",
        "cooking_items": "Corn husks, masa harina (corn flour), vegetable broth, black beans, corn, onion, garlic, jalapeno, chili powder, cumin, lime juice, avocado, salsa",
        "duration": "2 hours",
        "rating": 4.7,
        "how_to_cook": "1. Soak corn husks in warm water for at least 30 minutes to soften.\n2. In a large bowl, mix masa harina, vegetable broth, and spices until well combined to make the tamale dough.\n3. In a skillet, sauté diced onion, minced garlic, and chopped jalapeno until softened.\n4. Stir in black beans, corn, chili powder, cumin, and lime juice. Cook for a few minutes until heated through.\n5. Spread a thin layer of tamale dough onto each corn husk.\n6. Spoon the bean mixture onto the center of the dough.\n7. Fold the sides of the corn husk over the filling and roll to enclose.\n8. Steam tamales in a large pot for 1-1.5 hours until the dough is cooked through and firm.\n9. Serve hot with sliced avocado and salsa.",
        "description": "Vegan Tamales are a traditional Mexican dish made with corn masa dough filled with savory black bean and corn mixture, wrapped in corn husks, and steamed until tender. These vegan tamales are flavorful, comforting, and perfect for celebrating special occasions.",
        "protein": "6g",
        "carbohydrates": "40g",
        "fat": "5g",
        "fiber": "8g",
        "calcium": "40mg",
        "iron": "3mg",
        "favorite": true,
        "imageName": "vegan_tamales"
    },
    {
        "countryName": "Mexico",
        "category": "vegan",
        "id": 46,
        "meal_name": "Vegan Pozole",
        "cooking_items": "Hominy (corn), vegetable broth, onion, garlic, dried guajillo chilies, oregano, cumin, bay leaves, lime, radish, lettuce, avocado, cilantro",
        "duration": "2 hours",
        "rating": 4.6,
        "how_to_cook": "1. In a large pot, combine hominy, vegetable broth, diced onion, minced garlic, dried guajillo chilies, oregano, cumin, and bay leaves.\n2. Bring the mixture to a boil, then reduce heat and simmer for 1-1.5 hours until hominy is tender.\n3. Remove the dried chilies from the pot and discard.\n4. Season the pozole with salt and pepper to taste.\n5. Serve hot with lime wedges, sliced radish, shredded lettuce, diced avocado, and chopped cilantro.",
        "description": "Vegan Pozole is a traditional Mexican soup made with hominy (corn) in a savory broth flavored with dried chilies, garlic, and spices. This hearty and comforting soup is typically served during celebrations and special occasions in Mexico.",
        "protein": "5g",
        "carbohydrates": "30g",
        "fat": "3g",
        "fiber": "7g",
        "calcium": "60mg",
        "iron": "2.5mg",
        "favorite": false,
        "imageName": "vegan_pozole"
    },
    {
        "countryName": "Mexico",
        "category": "non-veg",
        "id": 47,
        "meal_name": "Tacos al Pastor",
        "cooking_items": "Pork shoulder, pineapple, onion, cilantro, corn tortillas, adobo marinade (achiote paste, garlic, vinegar, citrus juice, spices)",
        "duration": "2 hours",
        "rating": 4.9,
        "how_to_cook": "1. Marinate thinly sliced pork shoulder in adobo marinade for at least 2 hours or overnight.\n2. Thread marinated pork onto a vertical rotisserie (trompo) with slices of pineapple and onion.\n3. Cook the trompo over indirect heat, rotating occasionally, until the pork is cooked through and caramelized.\n4. Shave off slices of the cooked pork and pineapple from the trompo.\n5. Serve the meat on warm corn tortillas, topped with diced onion, chopped cilantro, and a squeeze of lime juice.",
        "description": "Tacos al Pastor is a quintessential Mexican street food dish featuring thinly sliced marinated pork cooked on a vertical rotisserie (trompo) with pineapple and onion. Served on corn tortillas with fresh toppings, these tacos are bursting with flavor and texture.",
        "protein": "20g",
        "carbohydrates": "15g",
        "fat": "10g",
        "fiber": "2g",
        "calcium": "30mg",
        "iron": "2.5mg",
        "favorite": true,
        "imageName": "tacos_al_pastor"
    },
    {
        "countryName": "Mexico",
        "category": "non-veg",
        "id": 48,
        "meal_name": "Mole Poblano",
        "cooking_items": "Chicken, mole sauce (chilies, chocolate, nuts, spices), onion, garlic, sesame seeds, tortillas, rice",
        "duration": "3 hours",
        "rating": 4.7,
        "how_to_cook": "1. Season chicken pieces with salt and pepper.\n2. In a large pot, brown chicken on all sides in oil over medium heat.\n3. Add diced onion and minced garlic to the pot and sauté until softened.\n4. Pour in mole sauce and enough water or chicken broth to cover the chicken.\n5. Simmer, covered, over low heat for 2-3 hours until the chicken is tender and the flavors meld.\n6. Toast sesame seeds in a dry skillet until golden brown.\n7. Serve the mole chicken with rice and tortillas, garnished with toasted sesame seeds.",
        "description": "Mole Poblano is a classic Mexican dish consisting of chicken simmered in a rich and complex sauce made from chilies, chocolate, nuts, and spices. This savory and slightly sweet dish is a symbol of Mexican culinary tradition and is often served on special occasions.",
        "protein": "25g",
        "carbohydrates": "20g",
        "fat": "15g",
        "fiber": "5g",
        "calcium": "60mg",
        "iron": "3mg",
        "favorite": true,
        "imageName": "mole_poblano"
    },
    {
        "countryName": "Jamaica",
        "category": "veg",
        "id": 49,
        "meal_name": "Ackee and Saltfish",
        "cooking_items": "Ackee fruit, bell peppers, onions, tomatoes, scallions, thyme, Scotch bonnet pepper (optional), garlic, olive oil",
        "duration": "30 minutes",
        "rating": 4.8,
        "how_to_cook": "1. Remove seeds and boil ackee fruit until tender, then drain and set aside.\n2. In a skillet, heat olive oil over medium heat.\n3. Sauté diced bell peppers, onions, tomatoes, scallions, and minced garlic until softened.\n4. Add boiled ackee fruit to the skillet and gently stir to combine.\n5. Season with fresh thyme and Scotch bonnet pepper (if using), and cook for a few more minutes.\n6. Serve hot with fried plantains, boiled green bananas, or rice.",
        "description": "Vegetarian Ackee and Saltfish is a traditional Jamaican dish made with ackee fruit, bell peppers, onions, tomatoes, and spices. This flavorful and colorful dish is a popular breakfast option in Jamaica and is enjoyed by locals and visitors alike.",
        "protein": "5g",
        "carbohydrates": "15g",
        "fat": "7g",
        "fiber": "4g",
        "calcium": "30mg",
        "iron": "2mg",
        "favorite": true,
        "imageName": "vegetarian_ackee_saltfish"
    },
    {
        "countryName": "Jamaica",
        "category": "veg",
        "id": 50,
        "meal_name": "Ital Stew",
        "cooking_items": "Vegetables (such as carrots, potatoes, cabbage, pumpkin, green beans), coconut milk, onion, garlic, thyme, Scotch bonnet pepper, allspice, salt",
        "duration": "1 hour",
        "rating": 4.7,
        "how_to_cook": "1. In a large pot, heat coconut milk over medium heat.\n2. Add diced onions, minced garlic, and chopped Scotch bonnet pepper to the pot and sauté until fragrant.\n3. Stir in chopped vegetables (carrots, potatoes, cabbage, pumpkin, green beans) and enough water to cover.\n4. Add fresh thyme, allspice, and salt to taste.\n5. Simmer the stew for 45 minutes to 1 hour, until the vegetables are tender.\n6. Serve hot with rice, dumplings, or breadfruit.",
        "description": "Vegetarian Ital Stew is a hearty and flavorful Jamaican stew made with a variety of vegetables cooked in creamy coconut milk and seasoned with aromatic spices. This traditional dish is part of the Ital cuisine, which is a dietary practice followed by Rastafarians.",
        "protein": "4g",
        "carbohydrates": "30g",
        "fat": "10g",
        "fiber": "6g",
        "calcium": "40mg",
        "iron": "3mg",
        "favorite": false,
        "imageName": "vegetarian_ital_stew"
    },
    {
        "countryName": "Jamaica",
        "category": "vegan",
        "id": 51,
        "meal_name": "Vegan Callaloo",
        "cooking_items": "Callaloo (or spinach), coconut milk, onion, garlic, tomato, scallion, thyme, Scotch bonnet pepper, allspice, salt, pepper",
        "duration": "30 minutes",
        "rating": 4.6,
        "how_to_cook": "1. In a large pot, heat coconut milk over medium heat.\n2. Add diced onions, minced garlic, chopped tomato, and sliced scallions to the pot and sauté until softened.\n3. Stir in washed and chopped callaloo leaves (or spinach) and enough water to cover.\n4. Add fresh thyme, chopped Scotch bonnet pepper (remove seeds for less heat), allspice, salt, and pepper to taste.\n5. Simmer the callaloo for 15-20 minutes until the leaves are tender and the flavors are well combined.\n6. Serve hot with rice, bread, or fried plantains.",
        "description": "Vegan Callaloo is a traditional Jamaican dish made with callaloo leaves (or spinach) cooked in creamy coconut milk with onions, garlic, tomatoes, and aromatic spices. This nutritious and flavorful dish is a staple in Jamaican cuisine and is enjoyed as a side dish or main course.",
        "protein": "6g",
        "carbohydrates": "10g",
        "fat": "8g",
        "fiber": "5g",
        "calcium": "60mg",
        "iron": "2mg",
        "favorite": false,
        "imageName": "vegan_callaloo"
    },
    {
        "countryName": "Jamaica",
        "category": "vegan",
        "id": 52,
        "meal_name": "Vegan Rundown",
        "cooking_items": "Green bananas, coconut milk, onion, garlic, tomato, scallion, thyme, Scotch bonnet pepper, allspice, salt, pepper",
        "duration": "45 minutes",
        "rating": 4.7,
        "how_to_cook": "1. Peel and slice green bananas into rounds.\n2. In a pot, combine coconut milk with diced onions, minced garlic, chopped tomatoes, sliced scallions, fresh thyme, and chopped Scotch bonnet pepper (remove seeds for less heat).\n3. Bring the coconut milk mixture to a simmer over medium heat.\n4. Add sliced green bananas to the pot and stir to combine.\n5. Season with allspice, salt, and pepper to taste.\n6. Simmer the rundown for 20-25 minutes until the bananas are tender and the sauce has thickened.\n7. Serve hot as a hearty and flavorful vegan dish.",
        "description": "Vegan Rundown is a traditional Jamaican dish made with green bananas cooked in creamy coconut milk with onions, garlic, tomatoes, scallions, and aromatic spices. This flavorful and comforting dish is popular in Jamaican cuisine and is enjoyed as a satisfying vegan meal.",
        "protein": "5g",
        "carbohydrates": "20g",
        "fat": "6g",
        "fiber": "6g",
        "calcium": "40mg",
        "iron": "2.5mg",
        "favorite": false,
        "imageName": "vegan_rundown"
    },
    {
        "countryName": "Jamaica",
        "category": "non-veg",
        "id": 53,
        "meal_name": "Jerk Chicken",
        "cooking_items": "Chicken, jerk seasoning (scotch bonnet peppers, allspice, thyme, garlic, ginger, scallions, brown sugar, soy sauce, vinegar), oil",
        "duration": "2 hours",
        "rating": 4.9,
        "how_to_cook": "1. Marinate chicken pieces in jerk seasoning for at least 1 hour or overnight.\n2. Preheat grill or barbecue to medium-high heat.\n3. Brush the grill with oil to prevent sticking.\n4. Grill chicken pieces for about 25-30 minutes, turning occasionally, until fully cooked and nicely charred.\n5. Serve hot with rice and peas, fried plantains, and coleslaw.",
        "description": "Jerk Chicken is a traditional Jamaican dish featuring chicken marinated in a spicy and flavorful jerk seasoning made with scotch bonnet peppers, allspice, thyme, garlic, and other aromatic ingredients. This dish is typically grilled over open flames for a smoky and delicious flavor.",
        "protein": "25g",
        "carbohydrates": "5g",
        "fat": "15g",
        "fiber": "1g",
        "calcium": "30mg",
        "iron": "2mg",
        "favorite": true,
        "imageName": "jerk_chicken"
    },
    {
        "countryName": "Jamaica",
        "category": "non-veg",
        "id": 54,
        "meal_name": "Escovitch Fish",
        "cooking_items": "Fish (such as snapper or kingfish), vinegar, carrots, onions, bell peppers, Scotch bonnet pepper, allspice, thyme, garlic, oil, flour, salt, pepper",
        "duration": "45 minutes",
        "rating": 4.7,
        "how_to_cook": "1. Clean and scale fish, then pat dry with paper towels.\n2. Season fish with salt and pepper, then lightly coat with flour.\n3. Heat oil in a skillet over medium heat.\n4. Fry fish until golden brown and cooked through, about 5-7 minutes per side.\n5. In a separate pan, heat vinegar with sliced onions, carrots, bell peppers, Scotch bonnet pepper, thyme, and allspice.\n6. Simmer the vinegar mixture for a few minutes until the vegetables are slightly softened.\n7. Pour the hot vinegar mixture over the fried fish.\n8. Let the fish marinate in the vinegar mixture for at least 30 minutes before serving.\n9. Serve hot or cold with bread or fried dumplings.",
        "description": "Escovitch Fish is a traditional Jamaican dish featuring fried fish marinated in a tangy vinegar sauce with onions, carrots, bell peppers, and aromatic spices. This flavorful and colorful dish is a popular choice for lunch or dinner in Jamaica.",
        "protein": "20g",
        "carbohydrates": "10g",
        "fat": "12g",
        "fiber": "2g",
        "calcium": "40mg",
        "iron": "1.5mg",
        "favorite": false,
        "imageName": "escovitch_fish"
    },
    {
        "countryName": "Brazil",
        "category": "veg",
        "id": 55,
        "meal_name": "Feijoada Vegetariana",
        "cooking_items": "Black beans, onions, garlic, carrots, bell peppers, tomatoes, collard greens, farofa (toasted cassava flour), rice",
        "duration": "2 hours",
        "rating": 4.8,
        "how_to_cook": "1. Soak black beans in water overnight, then drain and rinse.\n2. In a large pot, sauté diced onions and minced garlic until softened.\n3. Add soaked black beans to the pot along with water or vegetable broth.\n4. Bring to a boil, then reduce heat and simmer for 1-1.5 hours until beans are tender.\n5. Stir in diced carrots, bell peppers, and tomatoes, and continue to cook for another 30 minutes.\n6. Season with salt and pepper to taste.\n7. Serve hot with cooked rice, sliced collard greens, and farofa on the side.",
        "description": "Feijoada Vegetariana is a meatless version of Brazil's national dish, feijoada. It features black beans cooked with a variety of vegetables, including onions, garlic, carrots, bell peppers, and tomatoes. Served with rice, collard greens, and farofa, it's a hearty and flavorful meal.",
        "protein": "10g",
        "carbohydrates": "30g",
        "fat": "5g",
        "fiber": "8g",
        "calcium": "60mg",
        "iron": "3mg",
        "favorite": true,
        "imageName": "feijoada_vegetariana"
    },
    {
        "countryName": "Brazil",
        "category": "veg",
        "id": 56,
        "meal_name": "Moqueca de Palmito",
        "cooking_items": "Hearts of palm (palmito), onions, tomatoes, bell peppers, coconut milk, lime juice, garlic, cilantro, olive oil, salt, pepper",
        "duration": "45 minutes",
        "rating": 4.7,
        "how_to_cook": "1. In a large skillet, sauté sliced onions and minced garlic in olive oil until softened.\n2. Add diced tomatoes and bell peppers to the skillet and cook until they start to soften.\n3. Stir in sliced hearts of palm (palmito) and cook for a few more minutes.\n4. Pour in coconut milk and lime juice, and season with salt and pepper to taste.\n5. Simmer the mixture for 15-20 minutes until flavors are well combined and vegetables are tender.\n6. Garnish with chopped cilantro before serving.\n7. Serve hot with rice or bread.",
        "description": "Moqueca de Palmito is a Brazilian stew made with hearts of palm cooked in a flavorful broth of onions, tomatoes, bell peppers, coconut milk, and lime juice. This vegetarian version of the traditional moqueca dish is creamy, tangy, and packed with delicious flavors.",
        "protein": "8g",
        "carbohydrates": "25g",
        "fat": "10g",
        "fiber": "6g",
        "calcium": "50mg",
        "iron": "2.5mg",
        "favorite": false,
        "imageName": "moqueca_de_palmito"
    },
    {
        "countryName": "Brazil",
        "category": "vegan",
        "id": 57,
        "meal_name": "Açaí Bowl",
        "cooking_items": "Açaí berries (frozen or powdered), bananas, granola, berries (such as strawberries, blueberries, or raspberries), coconut flakes, honey or agave syrup (optional)",
        "duration": "10 minutes",
        "rating": 4.9,
        "how_to_cook": "1. Blend frozen açaí berries (or açaí powder) with ripe bananas until smooth and creamy.\n2. Pour the açaí mixture into a bowl.\n3. Top with granola, fresh berries, sliced bananas, and coconut flakes.\n4. Drizzle with honey or agave syrup if desired.\n5. Serve immediately and enjoy!",
        "description": "Açaí Bowl is a popular Brazilian dish made with blended açaí berries and bananas, topped with granola, fresh fruits, and coconut flakes. This refreshing and nutritious bowl is a favorite breakfast or snack in Brazil and is enjoyed by vegans and non-vegans alike.",
        "protein": "5g",
        "carbohydrates": "30g",
        "fat": "10g",
        "fiber": "8g",
        "calcium": "50mg",
        "iron": "2mg",
        "favorite": true,
        "imageName": "acai_bowl"
    },
    {
        "countryName": "Brazil",
        "category": "vegan",
        "id": 58,
        "meal_name": "Bobó de Cogumelos",
        "cooking_items": "Mushrooms, cassava (yuca), coconut milk, onions, garlic, tomatoes, bell peppers, cilantro, lime juice, olive oil, salt, pepper",
        "duration": "1 hour",
        "rating": 4.7,
        "how_to_cook": "1. Peel and dice cassava (yuca) into chunks, then boil in water until tender.\n2. In a blender, purée boiled cassava with coconut milk until smooth.\n3. In a large skillet, sauté diced onions and minced garlic in olive oil until softened.\n4. Add diced tomatoes and bell peppers to the skillet and cook until softened.\n5. Stir in sliced mushrooms and cook until they release their juices.\n6. Pour in the cassava-coconut mixture and simmer for 15-20 minutes until flavors are well combined.\n7. Season with salt, pepper, and lime juice to taste.\n8. Garnish with chopped cilantro before serving.\n9. Serve hot with rice or bread.",
        "description": "Bobó de Cogumelos is a Brazilian stew made with mushrooms cooked in a creamy sauce of puréed cassava (yuca) and coconut milk, flavored with onions, garlic, tomatoes, bell peppers, and cilantro. This vegan dish is hearty, flavorful, and perfect for a comforting meal.",
        "protein": "7g",
        "carbohydrates": "35g",
        "fat": "12g",
        "fiber": "9g",
        "calcium": "60mg",
        "iron": "3mg",
        "favorite": false,
        "imageName": "bobo_de_cogumelos"
    },
    {
        "countryName": "Brazil",
        "category": "non-veg",
        "id": 59,
        "meal_name": "Feijoada",
        "cooking_items": "Black beans, pork (such as pork shoulder, bacon, or sausage), onions, garlic, carrots, bell peppers, tomatoes, collard greens, farofa (toasted cassava flour), rice",
        "duration": "3 hours",
        "rating": 4.9,
        "how_to_cook": "1. Soak black beans in water overnight, then drain and rinse.\n2. In a large pot, combine black beans with pork (such as pork shoulder, bacon, or sausage), diced onions, minced garlic, diced carrots, diced bell peppers, and diced tomatoes.\n3. Add water to cover the ingredients and bring to a boil.\n4. Reduce heat and simmer for 2-3 hours until beans are tender and pork is cooked through.\n5. Serve hot with cooked rice, sliced collard greens, and farofa on the side.",
        "description": "Feijoada is a traditional Brazilian dish, often considered the national dish of Brazil. It is a hearty stew made with black beans and various cuts of pork, cooked with onions, garlic, carrots, bell peppers, and tomatoes. Served with rice, collard greens, and farofa, it's a flavorful and satisfying meal.",
        "protein": "30g",
        "carbohydrates": "40g",
        "fat": "20g",
        "fiber": "15g",
        "calcium": "100mg",
        "iron": "5mg",
        "favorite": true,
        "imageName": "feijoada"
    },
    {
        "countryName": "Brazil",
        "category": "non-veg",
        "id": 60,
        "meal_name": "Picanha",
        "cooking_items": "Picanha (rump cap or sirloin cap), coarse salt, olive oil, garlic, chimichurri sauce",
        "duration": "45 minutes",
        "rating": 4.8,
        "how_to_cook": "1. Preheat grill or barbecue to high heat.\n2. Season picanha generously with coarse salt on both sides.\n3. Place picanha on the grill fat-side down and cook for about 15 minutes, or until fat begins to render and char.\n4. Flip picanha and continue to cook for another 10-15 minutes for medium-rare doneness, or longer if desired.\n5. While picanha is cooking, prepare chimichurri sauce by mixing chopped garlic, parsley, oregano, red pepper flakes, olive oil, and vinegar in a bowl.\n6. Remove picanha from the grill and let it rest for a few minutes before slicing.\n7. Serve hot with chimichurri sauce on the side.",
        "description": "Picanha is a popular Brazilian cut of beef, known for its tender and flavorful meat. It is typically grilled or roasted and served with coarse salt and chimichurri sauce. Picanha is a favorite choice for barbecue gatherings and special occasions in Brazil.",
        "protein": "35g",
        "carbohydrates": "0g",
        "fat": "25g",
        "fiber": "0g",
        "calcium": "20mg",
        "iron": "3.5mg",
        "favorite": false,
        "imageName": "picanha"
    },
    {
        "countryName": "Nigeria",
        "category": "Veg",
        "id": 61,
        "meal_name": "Jollof Rice",
        "cooking_items": "Rice, tomato paste, onions, bell peppers, Scotch bonnet peppers, garlic, ginger, vegetable oil, spices (thyme, curry powder, bay leaves)",
        "duration": "60 minutes",
        "rating": 4.9,
        "how_to_cook": "1. Heat vegetable oil in a pot and sauté chopped onions, garlic, and ginger until fragrant.\n2. Add tomato paste and cook until it darkens slightly.\n3. Stir in chopped bell peppers and Scotch bonnet peppers, along with spices like thyme, curry powder, and bay leaves.\n4. Add washed rice and stir to coat with the tomato mixture.\n5. Pour in water or vegetable broth, cover the pot, and simmer until the rice is cooked through and has absorbed the flavors.\n6. Serve hot as a main dish or with sides like fried plantains or coleslaw.",
        "description": "Jollof rice is a beloved Nigerian dish made with rice cooked in a flavorful tomato-based sauce. It is a staple at celebrations and gatherings, known for its vibrant color and rich taste.",
        "protein": "5g",
        "carbohydrates": "40g",
        "fat": "10g",
        "fiber": "3g",
        "calcium": "30mg",
        "iron": "2mg",
        "favorite": true,
        "imageName": "jollof_rice"
    },
    {
        "countryName": "Nigeria",
        "category": "Veg",
        "id": 62,
        "meal_name": "Moi Moi",
        "cooking_items": "Black-eyed peas, onions, bell peppers, Scotch bonnet peppers, tomatoes, vegetable oil, spices (crayfish, bouillon cubes, salt)",
        "duration": "90 minutes",
        "rating": 4.7,
        "how_to_cook": "1. Soak black-eyed peas overnight, then blend them with onions, bell peppers, Scotch bonnet peppers, and tomatoes to form a smooth batter.\n2. Season the batter with spices like crayfish, bouillon cubes, and salt to taste.\n3. Grease containers or wraps with vegetable oil and pour in the batter.\n4. Steam the wrapped or containerized batter for about an hour or until firm.\n5. Allow Moi Moi to cool slightly before serving.",
        "description": "Moi Moi is a traditional Nigerian steamed bean pudding made from blended black-eyed peas and spices. It is often served as a side dish or a snack, and it's enjoyed for its soft texture and savory flavor.",
        "protein": "8g",
        "carbohydrates": "20g",
        "fat": "5g",
        "fiber": "6g",
        "calcium": "40mg",
        "iron": "1.5mg",
        "favorite": false,
        "imageName": "moi_moi"
    },
    {
        "countryName": "Nigeria",
        "category": "non-veg",
        "id": 63,
        "meal_name": "Suya",
        "cooking_items": "Beef or chicken skewers, groundnut powder, spices (such as cayenne pepper, ginger, garlic powder, onion powder), vegetable oil, tomatoes, onions, green peppers",
        "duration": "30 minutes",
        "rating": 4.8,
        "how_to_cook": "1. Prepare the meat skewers by marinating beef or chicken pieces in a mixture of groundnut powder, spices (cayenne pepper, ginger, garlic powder, onion powder), and vegetable oil.\n2. Grill the skewers over high heat, turning occasionally, until the meat is cooked through and slightly charred.\n3. While grilling, prepare a side of sliced tomatoes, onions, and green peppers.\n4. Serve the hot skewers with the sliced vegetables and extra groundnut powder for dipping.",
        "description": "Suya is a popular Nigerian street food consisting of skewered and grilled meat, typically beef or chicken, coated in a spicy groundnut powder. It's known for its smoky flavor and spicy kick.",
        "protein": "25g",
        "carbohydrates": "5g",
        "fat": "15g",
        "fiber": "2g",
        "calcium": "10mg",
        "iron": "2.5mg",
        "favorite": true,
        "imageName": "suya"
    },
    {
        "countryName": "Nigeria",
        "category": "non-veg",
        "id": 64,
        "meal_name": "Pepper Soup",
        "cooking_items": "Assorted meats (such as goat meat, beef, or chicken), peppers (such as Scotch bonnet peppers), onions, garlic, ginger, spices (such as uziza seeds, crayfish, and scent leaves)",
        "duration": "90 minutes",
        "rating": 4.7,
        "how_to_cook": "1. Clean and prepare the assorted meats, cutting them into bite-sized pieces.\n2. In a pot, combine the meats with chopped onions, garlic, ginger, and peppers (such as Scotch bonnet peppers).\n3. Add water to cover the ingredients and bring to a boil.\n4. Reduce the heat and simmer until the meats are tender.\n5. Season the soup with spices like uziza seeds, crayfish, and scent leaves.\n6. Serve hot as a comforting and spicy soup.",
        "description": "Pepper Soup is a traditional Nigerian soup known for its spicy and flavorful broth. It's made with assorted meats simmered with peppers, onions, and aromatic spices, making it a comforting and popular dish.",
        "protein": "30g",
        "carbohydrates": "8g",
        "fat": "20g",
        "fiber": "3g",
        "calcium": "15mg",
        "iron": "3mg",
        "favorite": true,
        "imageName": "pepper_soup"
    },
    {
        "countryName": "Nigeria",
        "category": "vegan",
        "id": 65,
        "meal_name": "Jollof Spaghetti",
        "cooking_items": "Spaghetti, tomato paste, onions, bell peppers, Scotch bonnet peppers, garlic, ginger, vegetable oil, spices (such as thyme, curry powder, and bay leaves)",
        "duration": "40 minutes",
        "rating": 4.5,
        "how_to_cook": "1. Cook spaghetti according to package instructions until al dente. Drain and set aside.\n2. In a separate pot, heat vegetable oil and sauté chopped onions, garlic, and ginger until fragrant.\n3. Add tomato paste and cook until it darkens slightly.\n4. Stir in chopped bell peppers and Scotch bonnet peppers, along with spices like thyme, curry powder, and bay leaves.\n5. Add the cooked spaghetti to the tomato mixture and toss until well combined.\n6. Cook for a few more minutes until heated through.\n7. Serve hot as a flavorful vegan alternative to traditional Jollof Rice.",
        "description": "Jollof Spaghetti is a vegan twist on the classic Nigerian Jollof Rice, featuring spaghetti cooked in a flavorful tomato-based sauce. It's a delicious and satisfying dish enjoyed by vegans and non-vegans alike.",
        "protein": "5g",
        "carbohydrates": "50g",
        "fat": "8g",
        "fiber": "4g",
        "calcium": "20mg",
        "iron": "2mg",
        "favorite": false,
        "imageName": "jollof_spaghetti"
    },
    {
        "countryName": "Nigeria",
        "category": "vegan",
        "id": 66,
        "meal_name": "Boli (Roasted Plantains)",
        "cooking_items": "Ripe plantains",
        "duration": "20 minutes",
        "rating": 4.6,
        "how_to_cook": "1. Preheat grill or barbecue to medium-high heat.\n2. Peel ripe plantains and cut them lengthwise into halves or quarters.\n3. Place the plantains on the grill and cook for about 10 minutes on each side, or until they are caramelized and tender.\n4. Remove from the grill and serve hot as a delicious and naturally sweet vegan snack or side dish.",
        "description": "Boli, or roasted plantains, is a popular Nigerian street food made from ripe plantains grilled until caramelized and tender. It's a simple yet delicious vegan dish enjoyed on its own or with spicy pepper sauce.",
        "protein": "1g",
        "carbohydrates": "30g",
        "fat": "0g",
        "fiber": "3g",
        "calcium": "5mg",
        "iron": "0.5mg",
        "favorite": false,
        "imageName": "boli"
    }
]
