[
    {
        "countryName": "Italy",
        "category": "veg",
        "id": 1,
        "meal_name": "Margherita Pizza",
        "cooking_items": "dough, tomato sauce, mozzarella cheese, basil leaves",
        "duration": "30 minutes",
        "rating": 4.8,
        "how_to_cook": "1. Preheat the oven to 475°F (245°C).\n 2. Roll out the dough and spread tomato sauce evenly.\n 3. Sprinkle shredded mozzarella cheese and basil leaves.\n 4. Bake for 10-15 minutes until crust is golden brown.",
        "favorite": false,
        "imageName": "margherita_pizza",
        "description": "A classic Italian pizza featuring a thin crust topped with tomato sauce, fresh mozzarella cheese, and fragrant basil leaves.",
        "protein": "12g",
        "carbohydrates": "35g",
        "fat": "10g",
        "fiber": "2g",
        "calcium": "200mg",
        "iron": "2.5mg"
    },
    {
        "countryName": "Italy",
        "category": "veg",
        "id": 2,
        "meal_name": "Eggplant Parmesan",
        "cooking_items": "Eggplant, marinara sauce, mozzarella cheese, Parmesan cheese, breadcrumbs, olive oil, fresh basil",
        "duration": "1 hour",
        "rating": 4.7,
        "how_to_cook": "1. Preheat oven to 375°F (190°C).\n 2. Slice eggplant and coat slices in breadcrumbs.\n 3. In a baking dish, layer marinara sauce, eggplant slices, mozzarella, and Parmesan cheeses.\n 4. Repeat layers and bake for 30-35 minutes until bubbly and golden.\n 5. Garnish with fresh basil before serving.",
        "favorite": false,
        "imageName": "eggplant_parmesan",
        "description": "A hearty Italian dish featuring layers of breaded eggplant slices, marinara sauce, melted mozzarella, and Parmesan cheeses, baked to perfection.",
        "protein": "15g",
        "carbohydrates": "25g",
        "fat": "18g",
        "fiber": "6g",
        "calcium": "300mg",
        "iron": "3.2mg"
    },
    {
        "countryName": "Italy",
        "category": "veg",
        "id": 3,
        "meal_name": "Caprese Salad",
        "cooking_items": "Fresh tomatoes, fresh mozzarella cheese, fresh basil leaves, extra virgin olive oil, balsamic glaze, salt, pepper",
        "duration": "15 minutes",
        "rating": 4.9,
        "how_to_cook": "1. Slice tomatoes and mozzarella into ¼ inch thick slices.\n 2. Arrange alternating slices of tomatoes, mozzarella, and basil leaves on a serving platter.\n 3. Drizzle with olive oil and balsamic glaze.\n 4. Season with salt and pepper to taste.\n 5. Serve immediately.",
        "favorite": false,
        "imageName": "caprese_salad",
        "description": "A refreshing Italian salad showcasing ripe tomatoes, creamy mozzarella cheese, and fresh basil leaves, drizzled with extra virgin olive oil and balsamic glaze.",
        "protein": "10g",
        "carbohydrates": "5g",
        "fat": "15g",
        "fiber": "2g",
        "calcium": "250mg",
        "iron": "1.8mg"
    },
    {
        "countryName": "Italy",
        "category": "non-veg",
        "id": 4,
        "meal_name": "Spaghetti Carbonara",
        "cooking_items": "Spaghetti, bacon, eggs, Parmesan cheese, black pepper, garlic, olive oil",
        "duration": "25 minutes",
        "rating": 4.8,
        "how_to_cook": "1. Cook spaghetti according to package instructions until al dente.\n 2. In a skillet, cook bacon until crispy. Remove from pan and drain on paper towels.\n 3. In a bowl, whisk together eggs, grated Parmesan cheese, minced garlic, and black pepper.\n 4. Drain spaghetti and immediately toss with egg mixture in a large bowl.\n 5. Crumble bacon over the top and serve hot.",
        "favorite": false,
        "imageName": "spaghetti_carbonara",
        "description": "A classic Italian pasta dish featuring spaghetti tossed with crispy bacon, a creamy Parmesan and egg sauce, and a hint of garlic and black pepper.",
        "protein": "20g",
        "carbohydrates": "50g",
        "fat": "25g",
        "fiber": "3g",
        "calcium": "150mg",
        "iron": "2.3mg"
    },
    {
        "countryName": "Italy",
        "category": "non-veg",
        "id": 5,
        "meal_name": "Osso Buco",
        "cooking_items": "Veal shanks, onion, carrots, celery, garlic, tomatoes, white wine, beef broth, flour, olive oil, salt, pepper, parsley",
        "duration": "2.5 hours",
        "rating": 4.6,
        "how_to_cook": "1. Season veal shanks with salt and pepper, then dredge in flour.\n 2. In a large skillet, heat olive oil over medium-high heat and brown veal shanks on all sides.\n 3. Transfer veal to a Dutch oven or slow cooker.\n 4. In the same skillet, sauté onion, carrots, celery, and garlic until softened.\n 5. Add tomatoes, white wine, and beef broth to the skillet. Pour mixture over veal in the Dutch oven.\n 6. Cover and cook on low heat for 2-2.5 hours until veal is tender.\n 7. Garnish with chopped parsley before serving.",
        "favorite": false,
        "imageName": "osso_buco",
        "description": "A luxurious Italian stew featuring tender veal shanks simmered with aromatic vegetables, tomatoes, and white wine until rich and flavorful, garnished with fresh parsley.",
        "protein": "12g",
        "carbohydrates": "35g",
        "fat": "10g",
        "fiber": "2g",
        "calcium": "200mg",
        "iron": "2.5mg"
    },
    {
        "countryName": "Italy",
        "category": "vegan",
        "id": 6,
        "meal_name": "Pasta Primavera",
        "cooking_items": "Pasta, assorted spring vegetables, olive oil, garlic, lemon juice, fresh herbs, salt, pepper",
        "duration": "20 minutes",
        "rating": 4.5,
        "how_to_cook": "1. Cook pasta according to package instructions until al dente.\n 2. In a large skillet, heat olive oil over medium heat and sauté minced garlic until fragrant.\n 3. Add assorted vegetables to the skillet and cook until tender-crisp.\n 4. Toss cooked pasta with the vegetables in the skillet.\n 5. Season with lemon juice, salt, pepper, and fresh herbs.\n 6. Serve hot, garnished with additional fresh herbs if desired.",
        "favorite": false,
        "imageName": "pasta_primavera",
        "description": "A vibrant Italian pasta dish bursting with the flavors of spring vegetables, tossed with al dente pasta and a zesty garlic and lemon dressing, perfect for vegans and vegetable lovers alike.",
        "protein": "6g",
        "carbohydrates": "32g",
        "fat": "6g",
        "fiber": "6g",
        "calcium": "20mg",
        "iron": "1mg"
    },
    {
      "countryName": "India",
      "category": "vegan",
      "id": 7,
      "meal_name": "Chana Masala",
      "cooking_items": "Cooked chickpeas, vegetable oil, onion, garlic, ginger, tomatoes, ground cumin, ground coriander, turmeric powder, cayenne pepper, garam masala, salt, cilantro leaves",
      "duration": "40 minutes",
      "rating": 4.8,
      "how_to_cook": "1. Heat oil in a large skillet over medium heat.\n2. Add chopped onions and sauté until golden brown.\n3. Add minced garlic and ginger, and cook for another minute until fragrant.\n4. Stir in chopped tomatoes and cook until they soften and turn mushy.\n5. Add ground cumin, ground coriander, turmeric powder, cayenne pepper, and salt. Cook the spices with the tomatoes for a couple of minutes.\n6. Add cooked chickpeas to the skillet and mix well with the spices and tomatoes.\n7. Pour in about a cup of water, bring to a simmer, and let it cook for 10-15 minutes until the flavors meld together and the curry thickens.\n8. Sprinkle garam masala over the curry and stir to combine.\n9. Garnish with fresh cilantro leaves and serve hot with rice or naan.",
      "favorite": false,
      "imageName": "chana_masala",
      "description": "A classic Indian dish featuring chickpeas cooked in a flavorful blend of spices, onions, and tomatoes, garnished with fresh cilantro leaves, perfect for vegans and lovers of Indian cuisine.",
      "protein": "9g",
      "carbohydrates": "35g",
      "fat": "5g",
      "fiber": "10g",
      "calcium": "80mg",
      "iron": "3.5mg"
    },
    {
      "countryName": "India",
      "category": "vegan",
      "id": 8,
      "meal_name": "Baingan Bharta",
      "cooking_items": "Eggplants, vegetable oil, cumin seeds, onion, tomatoes, green chilies, ginger-garlic paste, ground coriander, turmeric powder, garam masala, salt, cilantro leaves",
      "duration": "45 minutes",
      "rating": 4.7,
      "how_to_cook": "1. Roast the eggplants over an open flame or grill until the skin is charred and the flesh is soft. Let them cool, then peel off the charred skin and mash the flesh. Set aside.\n2. Heat oil in a skillet over medium heat. Add cumin seeds and let them splutter.\n3. Add chopped onions and sauté until they turn translucent.\n4. Stir in chopped tomatoes, green chilies, and ginger-garlic paste. Cook until the tomatoes are soft and mashed.\n5. Add ground coriander, turmeric powder, garam masala, and salt. Mix well.\n6. Add the mashed eggplant to the skillet and combine with the spices and tomatoes. Cook for another 5-7 minutes, stirring occasionally.\n7. Garnish with fresh cilantro leaves and serve hot with roti or rice.",
      "favorite": false,
      "imageName": "baingan_bharta",
      "description": "A smoky and flavorful Indian curry made with roasted eggplants, onions, tomatoes, and aromatic spices, garnished with fresh cilantro leaves, perfect for vegans and lovers of Indian cuisine.",
      "protein": "4g",
      "carbohydrates": "20g",
      "fat": "8g",
      "fiber": "9g",
      "calcium": "40mg",
      "iron": "2mg"
    },
    {
      "countryName": "India",
      "category": "non-veg",
      "id": 9,
      "meal_name": "Chicken Tikka Masala",
      "cooking_items": "Boneless chicken, yogurt, lemon juice, garlic, ginger, ground cumin, ground coriander, garam masala, paprika, turmeric powder, tomato sauce, cream, butter, salt, cilantro leaves",
      "duration": "45 minutes",
      "rating": 4.9,
      "how_to_cook": "1. Marinate boneless chicken pieces in a mixture of yogurt, lemon juice, minced garlic, grated ginger, ground cumin, ground coriander, garam masala, paprika, turmeric powder, and salt. Let it marinate for at least 30 minutes.\n2. Preheat the oven to 400°F (200°C). Thread the marinated chicken pieces onto skewers and place them on a baking tray. Bake for 20-25 minutes until the chicken is cooked through.\n3. In a large skillet, heat butter over medium heat. Add minced garlic and cook until fragrant.\n4. Stir in tomato sauce and cream. Simmer for a few minutes until the sauce thickens.\n5. Add the baked chicken tikka pieces to the skillet and simmer for another 5-10 minutes, stirring occasionally.\n6. Garnish with fresh cilantro leaves and serve hot with rice or naan.",
      "favorite": true,
      "imageName": "chicken_tikka_masala",
      "description": "A popular Indian dish featuring tender pieces of chicken marinated in yogurt and spices, grilled to perfection, and simmered in a creamy tomato sauce, garnished with fresh cilantro leaves, perfect for non-vegetarians and lovers of Indian cuisine.",
      "protein": "30g",
      "carbohydrates": "15g",
      "fat": "18g",
      "fiber": "3g",
      "calcium": "100mg",
      "iron": "2.5mg"
    },
    {
      "countryName": "India",
      "category": "non-veg",
      "id": 10,
      "meal_name": "Tandoori Lamb Chops",
      "cooking_items": "Lamb chops, yogurt, lemon juice, garlic, ginger, ground cumin, ground coriander, garam masala, paprika, turmeric powder, cayenne pepper, salt, mint leaves",
      "duration": "35 minutes",
      "rating": 4.7,
      "how_to_cook": "1. In a large bowl, mix yogurt, lemon juice, minced garlic, grated ginger, ground cumin, ground coriander, garam masala, paprika, turmeric powder, cayenne pepper, and salt to make the marinade.\n2. Add lamb chops to the marinade and coat them well. Let them marinate for at least 1 hour, or preferably overnight in the refrigerator.\n3. Preheat the grill to medium-high heat. Remove the lamb chops from the marinade and shake off any excess.\n4. Grill the lamb chops for 3-4 minutes on each side, or until they are cooked to your desired doneness.\n5. Garnish with fresh mint leaves and serve hot with mint yogurt sauce and naan.",
      "favorite": false,
      "imageName": "tandoori_lamb_chops",
      "description": "Delicious and succulent lamb chops marinated in a blend of yogurt and aromatic spices, grilled to perfection, and served with a refreshing mint yogurt sauce, perfect for non-vegetarians and lovers of Indian cuisine.",
      "protein": "25g",
      "carbohydrates": "5g",
      "fat": "15g",
      "fiber": "1g",
      "calcium": "50mg",
      "iron": "3mg"
    },
    {
      "countryName": "India",
      "category": "veg",
      "id": 11,
      "meal_name": "Palak Paneer",
      "cooking_items": "Spinach, paneer (cottage cheese), vegetable oil, onion, garlic, ginger, tomatoes, green chilies, ground cumin, ground coriander, turmeric powder, garam masala, salt, cream",
      "duration": "45 minutes",
      "rating": 4.9,
      "how_to_cook": "1. Blanch spinach leaves in boiling water for 2 minutes. Drain and transfer to ice water to retain the color. Drain again and blend into a smooth puree.\n2. Heat oil in a pan. Add chopped onions, garlic, and ginger. Sauté until golden brown.\n3. Add chopped tomatoes and green chilies. Cook until tomatoes are soft.\n4. Add ground cumin, ground coriander, turmeric powder, and salt. Cook for 2-3 minutes.\n5. Pour in the spinach puree and cook for 5-7 minutes.\n6. Add cubed paneer (cottage cheese) and garam masala. Cook for another 5 minutes.\n7. Stir in cream and simmer for a few more minutes.\n8. Garnish with cream and serve hot with rice or naan.",
      "favorite": false,
      "imageName": "palak_paneer",
      "description": "A classic North Indian dish featuring creamy spinach curry with chunks of paneer (cottage cheese), delicately spiced and finished with a touch of cream, perfect for vegetarians and lovers of Indian cuisine.",
      "protein": "12g",
      "carbohydrates": "10g",
      "fat": "14g",
      "fiber": "4g",
      "calcium": "300mg",
      "iron": "2.5mg"
    },
    {
      "countryName": "India",
      "category": "veg",
      "id": 12,
      "meal_name": "Vegetable Biryani",
      "cooking_items": "Basmati rice, mixed vegetables (carrots, peas, cauliflower, potatoes), vegetable oil, onion, garlic, ginger, tomatoes, green chilies, bay leaves, cinnamon stick, cloves, cardamom pods, cumin seeds, ground coriander, ground cumin, turmeric powder, garam masala, salt, saffron strands (optional), milk (optional), fried onions, mint leaves, cilantro leaves",
      "duration": "60 minutes",
      "rating": 4.7,
      "how_to_cook": "1. Wash and soak basmati rice in water for 30 minutes. Drain and set aside.\n2. Heat oil in a large pan. Add whole spices (bay leaves, cinnamon stick, cloves, cardamom pods) and cumin seeds. Sauté until fragrant.\n3. Add chopped onions, garlic, ginger, and green chilies. Cook until onions are golden brown.\n4. Stir in chopped tomatoes and cook until they soften.\n5. Add mixed vegetables and cook for a few minutes.\n6. Add ground spices (ground coriander, ground cumin, turmeric powder, garam masala) and salt. Mix well.\n7. In a separate pot, boil water and add soaked rice. Cook until rice is 70% done. Drain and set aside.\n8. Layer the vegetable mixture and rice in the pan. Top with fried onions, mint leaves, and cilantro leaves.\n9. If using saffron, soak it in warm milk and drizzle over the layers.\n10. Cover the pan tightly and cook on low heat for 15-20 minutes until the rice is fully cooked and aromatic.\n11. Serve hot with raita or yogurt.",
      "favorite": false,
      "imageName": "vegetable_biryani",
      "description": "A fragrant and colorful Indian rice dish cooked with a variety of vegetables and aromatic spices, layered with fluffy basmati rice, and garnished with fried onions and fresh herbs, a delightful vegetarian option for any occasion.",
      "protein": "8g",
      "carbohydrates": "60g",
      "fat": "12g",
      "fiber": "7g",
      "calcium": "120mg",
      "iron": "3.5mg"
    },
    {
      "countryName": "Spain",
      "category": "veg",
      "id": 13,
      "meal_name": "Gazpacho",
      "cooking_items": "Tomatoes, cucumber, bell pepper, onion, garlic, bread, olive oil, red wine vinegar, salt, black pepper",
      "duration": "15 minutes",
      "rating": 4.6,
      "how_to_cook": "1. Roughly chop tomatoes, cucumber, bell pepper, and onion.\n2. Place the chopped vegetables in a blender or food processor. Add garlic, bread (crust removed), olive oil, and red wine vinegar.\n3. Blend until smooth and well combined.\n4. Season with salt and black pepper to taste. Adjust the consistency by adding water if necessary.\n5. Chill the gazpacho in the refrigerator for at least 1 hour before serving.\n6. Serve cold, garnished with chopped vegetables or fresh herbs, if desired.",
      "favorite": true,
      "imageName": "gazpacho",
      "description": "A refreshing Spanish cold soup made from ripe tomatoes, cucumber, bell pepper, onion, garlic, olive oil, and bread, blended to perfection and served chilled, perfect for hot summer days.",
      "protein": "3g",
      "carbohydrates": "15g",
      "fat": "8g",
      "fiber": "3g",
      "calcium": "40mg",
      "iron": "1mg"
    },
    {
      "countryName": "Spain",
      "category": "veg",
      "id": 14,
      "meal_name": "Tortilla Española",
      "cooking_items": "Potatoes, eggs, onion, olive oil, salt",
      "duration": "40 minutes",
      "rating": 4.7,
      "how_to_cook": "1. Peel and thinly slice potatoes. Finely chop onions.\n2. Heat olive oil in a non-stick skillet over medium heat.\n3. Add sliced potatoes and onions to the skillet. Cook, stirring occasionally, until potatoes are tender but not browned.\n4. In a large bowl, beat eggs and season with salt.\n5. Remove the cooked potatoes and onions from the skillet and drain excess oil.\n6. Add the potatoes and onions to the beaten eggs and mix well.\n7. Heat a little more olive oil in the skillet. Pour the potato and egg mixture into the skillet.\n8. Cook over low heat, occasionally lifting the edges to allow uncooked eggs to flow underneath.\n9. Once the bottom is set and the top is slightly runny, flip the omelette using a plate or lid.\n10. Cook for a few more minutes until fully set.\n11. Slide the tortilla onto a serving plate and let it cool slightly before slicing.\n12. Serve warm or at room temperature.",
      "favorite": false,
      "imageName": "tortilla_espanola",
      "description": "A classic Spanish dish consisting of thinly sliced potatoes and onions bound together with beaten eggs, cooked until golden and set, creating a hearty and flavorful omelette, perfect for any meal.",
      "protein": "10g",
      "carbohydrates": "20g",
      "fat": "15g",
      "fiber": "3g",
      "calcium": "60mg",
      "iron": "2mg"
    },
    {
      "countryName": "Spain",
      "category": "non-veg",
      "id": 15,
      "meal_name": "Paella Valenciana",
      "cooking_items": "Rice, chicken pieces, rabbit meat, green beans, tomatoes, bell peppers, saffron threads, olive oil, garlic, onion, paprika, salt, pepper",
      "duration": "60 minutes",
      "rating": 4.8,
      "how_to_cook": "1. Heat olive oil in a paella pan over medium heat.\n2. Sauté chopped onion and minced garlic until translucent.\n3. Add chicken pieces and rabbit meat to the pan. Cook until browned on all sides.\n4. Stir in chopped tomatoes, sliced bell peppers, and green beans. Cook for a few minutes.\n5. Sprinkle paprika over the mixture and stir well.\n6. Add rice to the pan and stir to coat it with the oil and spices.\n7. Pour in enough chicken or vegetable broth to cover the rice. Add saffron threads for color and flavor.\n8. Season with salt and pepper to taste. Bring to a simmer.\n9. Let the paella cook for about 20-25 minutes, without stirring, until the rice is cooked and the liquid is absorbed.\n10. Remove from heat and let it rest for a few minutes before serving. Garnish with lemon wedges if desired.",
      "favorite": true,
      "imageName": "paella_valenciana",
      "description": "A traditional Spanish rice dish cooked in a wide, shallow pan, featuring a flavorful combination of chicken, rabbit meat, green beans, and bell peppers, infused with saffron, a classic and beloved dish from the Valencia region of Spain.",
      "protein": "25g",
      "carbohydrates": "40g",
      "fat": "15g",
      "fiber": "5g",
      "calcium": "80mg",
      "iron": "3mg"
    },
    {
      "countryName": "Spain",
      "category": "non-veg",
      "id": 16,
      "meal_name": "Gambas al Ajillo",
      "cooking_items": "Shrimp, olive oil, garlic, red pepper flakes, parsley, salt",
      "duration": "15 minutes",
      "rating": 4.7,
      "how_to_cook": "1. Heat olive oil in a large skillet over medium heat.\n2. Add minced garlic and red pepper flakes to the skillet. Cook until garlic is fragrant but not browned.\n3. Add shrimp to the skillet and cook until they turn pink and opaque, about 2-3 minutes on each side.\n4. Season with salt to taste.\n5. Sprinkle chopped parsley over the shrimp and toss to combine.\n6. Remove from heat and transfer the shrimp to a serving dish.\n7. Serve hot, garnished with additional parsley and lemon wedges if desired.",
      "favorite": false,
      "imageName": "gambas_al_ajillo",
      "description": "A classic Spanish tapa featuring tender shrimp cooked in olive oil with garlic and red pepper flakes, finished with a sprinkle of fresh parsley, bursting with bold flavors and perfect for sharing.",
      "protein": "20g",
      "carbohydrates": "2g",
      "fat": "10g",
      "fiber": "0g",
      "calcium": "60mg",
      "iron": "2.5mg"
    },
    {
      "countryName": "Spain",
      "category": "vegan",
      "id": 17,
      "meal_name": "Spanish Potato Tortilla",
      "cooking_items": "Potatoes, onions, olive oil, chickpea flour (besan), water, salt, pepper",
      "duration": "45 minutes",
      "rating": 4.5,
      "how_to_cook": "1. Peel and thinly slice potatoes and onions.\n2. Heat olive oil in a non-stick skillet over medium heat.\n3. Add potatoes and onions to the skillet. Cook, stirring occasionally, until potatoes are tender and onions are translucent, about 15-20 minutes.\n4. In a mixing bowl, whisk chickpea flour with water until smooth. Season with salt and pepper.\n5. Pour the chickpea flour mixture over the cooked potatoes and onions in the skillet. Stir gently to combine.\n6. Cook for another 5-7 minutes until the edges start to set.\n7. Place a large plate over the skillet and carefully flip the tortilla onto the plate.\n8. Slide the tortilla back into the skillet and cook for another 5-7 minutes until fully set and golden brown.\n9. Remove from heat and let it cool slightly before slicing into wedges.\n10. Serve warm or at room temperature as a delicious and hearty vegan Spanish dish.",
      "favorite": false,
      "imageName": "spanish_potato_tortilla",
      "description": "A traditional Spanish omelette made with layers of thinly sliced potatoes and onions, bound together with a chickpea flour mixture, resulting in a hearty and flavorful vegan alternative to the classic tortilla española.",
      "protein": "5g",
      "carbohydrates": "30g",
      "fat": "12g",
      "fiber": "4g",
      "calcium": "40mg",
      "iron": "2mg"
    },
    {
      "countryName": "Spain",
      "category": "vegan",
      "id": 18,
      "meal_name": "Patatas Bravas",
      "cooking_items": "Potatoes, olive oil, paprika, garlic powder, salt, pepper, tomato sauce, hot sauce (optional)",
      "duration": "45 minutes",
      "rating": 4.5,
      "how_to_cook": "1. Preheat the oven to 200°C (400°F).\n2. Peel and cut potatoes into small cubes.\n3. Toss the potato cubes in olive oil, paprika, garlic powder, salt, and pepper until evenly coated.\n4. Spread the seasoned potatoes on a baking sheet in a single layer.\n5. Bake for 30-35 minutes, flipping halfway through, until the potatoes are crispy and golden brown.\n6. While the potatoes are baking, prepare the sauce by combining tomato sauce with hot sauce (if using) in a small saucepan. Heat over medium heat until warmed through.\n7. Once the potatoes are done, transfer them to a serving dish.\n8. Drizzle the sauce over the potatoes or serve it on the side for dipping.\n9. Garnish with chopped parsley, if desired, and serve hot.",
      "favorite": false,
      "imageName": "patatas_bravas",
      "description": "A classic Spanish tapas dish featuring crispy roasted potatoes seasoned with paprika and garlic powder, served with a zesty tomato sauce, perfect for snacking or as a side dish, and suitable for vegans.",
      "protein": "3g",
      "carbohydrates": "25g",
      "fat": "10g",
      "fiber": "4g",
      "calcium": "20mg",
      "iron": "1mg"
    }
]
