[
    {
        "countryName": "Italy",
        "category": "veg",
        "id": 1,
        "meal_name": "Margherita Pizza",
        "cooking_items": "dough, tomato sauce, mozzarella cheese, basil leaves",
        "duration": "30 minutes",
        "rating": 4.8,
        "how_to_cook": "\n 1. Preheat the oven to 475°F (245°C).\n 2. Roll out the dough and spread tomato sauce evenly.\n 3. Sprinkle shredded mozzarella cheese and basil leaves.\n 4. Bake for 10-15 minutes until crust is golden brown.",
        "favorite": false,
        "imageName": "margherita_pizza.jpg",
        "description": "A classic Italian pizza featuring a thin crust topped with tomato sauce, fresh mozzarella cheese, and fragrant basil leaves.",
        "protein": "12g",
        "carbohydrates": "35g",
        "fat": "10g",
        "fiber": "2g",
        "calcium": "200mg",
        "iron": "2.5mg"
    },
    {
        "countryName": "Italy",
        "category": "veg",
        "id": 2,
        "meal_name": "Eggplant Parmesan",
        "cooking_items": "Eggplant, marinara sauce, mozzarella cheese, Parmesan cheese, breadcrumbs, olive oil, fresh basil",
        "duration": "1 hour",
        "rating": 4.7,
        "how_to_cook": "\n 1. Preheat oven to 375°F (190°C).\n 2. Slice eggplant and coat slices in breadcrumbs.\n 3. In a baking dish, layer marinara sauce, eggplant slices, mozzarella, and Parmesan cheeses.\n 4. Repeat layers and bake for 30-35 minutes until bubbly and golden.\n 5. Garnish with fresh basil before serving.",
        "favorite": false,
        "imageName": "eggplant_parmesan.jpg",
        "description": "A hearty Italian dish featuring layers of breaded eggplant slices, marinara sauce, melted mozzarella, and Parmesan cheeses, baked to perfection.",
        "protein": "15g",
        "carbohydrates": "25g",
        "fat": "18g",
        "fiber": "6g",
        "calcium": "300mg",
        "iron": "3.2mg"
    },
    {
        "countryName": "Italy",
        "category": "veg",
        "id": 3,
        "meal_name": "Caprese Salad",
        "cooking_items": "Fresh tomatoes, fresh mozzarella cheese, fresh basil leaves, extra virgin olive oil, balsamic glaze, salt, pepper",
        "duration": "15 minutes",
        "rating": 4.9,
        "how_to_cook": "\n 1. Slice tomatoes and mozzarella into ¼ inch thick slices.\n 2. Arrange alternating slices of tomatoes, mozzarella, and basil leaves on a serving platter.\n 3. Drizzle with olive oil and balsamic glaze.\n 4. Season with salt and pepper to taste.\n 5. Serve immediately.",
        "favorite": false,
        "imageName": "caprese_salad.jpg",
        "description": "A refreshing Italian salad showcasing ripe tomatoes, creamy mozzarella cheese, and fresh basil leaves, drizzled with extra virgin olive oil and balsamic glaze.",
        "protein": "10g",
        "carbohydrates": "5g",
        "fat": "15g",
        "fiber": "2g",
        "calcium": "250mg",
        "iron": "1.8mg"
    },
    {
        "countryName": "Italy",
        "category": "non-veg",
        "id": 4,
        "meal_name": "Spaghetti Carbonara",
        "cooking_items": "Spaghetti, bacon, eggs, Parmesan cheese, black pepper, garlic, olive oil",
        "duration": "25 minutes",
        "rating": 4.8,
        "how_to_cook": "\n 1. Cook spaghetti according to package instructions until al dente.\n 2. In a skillet, cook bacon until crispy. Remove from pan and drain on paper towels.\n 3. In a bowl, whisk together eggs, grated Parmesan cheese, minced garlic, and black pepper.\n 4. Drain spaghetti and immediately toss with egg mixture in a large bowl.\n 5. Crumble bacon over the top and serve hot.",
        "favorite": false,
        "imageName": "spaghetti_carbonara.jpg",
        "description": "A classic Italian pasta dish featuring spaghetti tossed with crispy bacon, a creamy Parmesan and egg sauce, and a hint of garlic and black pepper.",
        "protein": "20g",
        "carbohydrates": "50g",
        "fat": "25g",
        "fiber": "3g",
        "calcium": "150mg",
        "iron": "2.3mg"
    },
    {
        "countryName": "Italy",
        "category": "non-veg",
        "id": 5,
        "meal_name": "Osso Buco",
        "cooking_items": "Veal shanks, onion, carrots, celery, garlic, tomatoes, white wine, beef broth, flour, olive oil, salt, pepper, parsley",
        "duration": "2.5 hours",
        "rating": 4.6,
        "how_to_cook": "\n 1. Season veal shanks with salt and pepper, then dredge in flour.\n 2. In a large skillet, heat olive oil over medium-high heat and brown veal shanks on all sides.\n 3. Transfer veal to a Dutch oven or slow cooker.\n 4. In the same skillet, sauté onion, carrots, celery, and garlic until softened.\n 5. Add tomatoes, white wine, and beef broth to the skillet. Pour mixture over veal in the Dutch oven.\n 6. Cover and cook on low heat for 2-2.5 hours until veal is tender. 7. Garnish with chopped parsley before serving.",
        "favorite": false,
        "imageName": "osso_buco.jpg",
        "description": "A luxurious Italian stew featuring tender veal shanks simmered with aromatic vegetables, tomatoes, and white wine until rich and flavorful, garnished with fresh parsley.",
        "protein": "12g",
        "carbohydrates": "35g",
        "fat": "10g",
        "fiber": "2g",
        "calcium": "200mg",
        "iron": "2.5mg"
    },
    {
        "countryName": "Italy",
        "category": "vegan",
        "id": 6,
        "meal_name": "Pasta Primavera",
        "cooking_items": "Pasta, assorted spring vegetables, olive oil, garlic, lemon juice, fresh herbs, salt, pepper",
        "duration": "20 minutes",
        "rating": 4.5,
        "how_to_cook": "\n 1. Cook pasta according to package instructions until al dente.\n 2. In a large skillet, heat olive oil over medium heat and sauté minced garlic until fragrant.\n 3. Add assorted vegetables to the skillet and cook until tender-crisp.\n 4. Toss cooked pasta with the vegetables in the skillet.\n 5. Season with lemon juice, salt, pepper, and fresh herbs. 6. Serve hot, garnished with additional fresh herbs if desired.",
        "favorite": false,
        "imageName": "pasta_primavera.jpg",
        "description": "A vibrant Italian pasta dish bursting with the flavors of spring vegetables, tossed with al dente pasta and a zesty garlic and lemon dressing, perfect for vegans and vegetable lovers alike.",
        "protein": "6g",
        "carbohydrates": "32g",
        "fat": "6g",
        "fiber": "6g",
        "calcium": "20mg",
        "iron": "1mg"
    }
]
